{
  "text": {
    " ": 0,
    "h": 290,
    "e": 208,
    "y": 557,
    " h": 48,
    "he": 302,
    "ey": 256,
    "y ": 558,
    " he": 51,
    "hey": 308,
    "ey ": 257,
    " hey": 53,
    "hey ": 309,
    "o": 414,
    "w": 550,
    "d": 193,
    "ho": 314,
    "ow": 458,
    "wd": 551,
    "dy": 206,
    " ho": 56,
    "how": 317,
    "owd": 459,
    "wdy": 552,
    "dy ": 207,
    " how": 57,
    "howd": 318,
    "owdy": 460,
    "wdy ": 553,
    "t": 521,
    "r": 466,
    " t": 89,
    "th": 528,
    "er": 244,
    "re": 474,
    "e ": 209,
    " th": 90,
    "the": 532,
    "her": 306,
    "ere": 245,
    "re ": 475,
    " the": 92,
    "ther": 534,
    "here": 307,
    "ere ": 246,
    "l": 359,
    "el": 231,
    "ll": 366,
    "lo": 371,
    "o ": 415,
    "hel": 304,
    "ell": 232,
    "llo": 367,
    "lo ": 372,
    " hel": 52,
    "hell": 305,
    "ello": 233,
    "llo ": 368,
    "i": 321,
    "hi": 310,
    "i ": 322,
    " hi": 54,
    "hi ": 311,
    " hi ": 55,
    "g": 268,
    " g": 41,
    "go": 280,
    "oo": 437,
    "od": 421,
    "d ": 194,
    " go": 44,
    "goo": 281,
    "ood": 438,
    "od ": 422,
    " goo": 45,
    "good": 282,
    "ood ": 439,
    "m": 377,
    "n": 389,
    " m": 64,
    "mo": 384,
    "or": 443,
    "rn": 493,
    "ni": 405,
    "in": 334,
    "ng": 403,
    "g ": 269,
    " mo": 67,
    "mor": 387,
    "orn": 447,
    "rni": 494,
    "nin": 408,
    "ing": 339,
    "ng ": 404,
    " mor": 68,
    "morn": 388,
    "orni": 448,
    "rnin": 495,
    "ning": 409,
    "ing ": 340,
    "v": 545,
    " e": 35,
    "ev": 253,
    "ve": 546,
    "en": 234,
    " ev": 36,
    "eve": 254,
    "ven": 548,
    "eni": 237,
    " eve": 37,
    "even": 255,
    "veni": 549,
    "enin": 238,
    "a": 107,
    " d": 32,
    "de": 198,
    "ea": 210,
    "ar": 145,
    "r ": 467,
    " de": 33,
    "dea": 199,
    "ear": 215,
    "ar ": 146,
    " dea": 34,
    "dear": 200,
    "ear ": 216,
    "s": 504,
    " s": 80,
    "si": 512,
    "ir": 344,
    " si": 85,
    "sir": 513,
    "ir ": 345,
    " sir": 86,
    "sir ": 514,
    " y": 96,
    "ye": 559,
    "es": 251,
    "s ": 505,
    " ye": 97,
    "yes": 565,
    "es ": 252,
    " yes": 100,
    "yes ": 566,
    "p": 461,
    "ep": 242,
    "p ": 462,
    "yep": 563,
    "ep ": 243,
    " yep": 99,
    "yep ": 564,
    "ah": 115,
    "h ": 291,
    "yea": 561,
    "eah": 211,
    "ah ": 116,
    " yea": 98,
    "yeah": 562,
    "eah ": 212,
    " i": 58,
    "nd": 397,
    "ee": 224,
    "ed": 222,
    " in": 59,
    "ind": 337,
    "nde": 399,
    "dee": 201,
    "eed": 226,
    "ed ": 223,
    " ind": 60,
    "inde": 338,
    "ndee": 400,
    "deed": 202,
    "eed ": 227,
    "ha": 292,
    "at": 147,
    "t ": 522,
    "tha": 529,
    "hat": 298,
    "at ": 148,
    " tha": 91,
    "that": 531,
    "hat ": 299,
    "b": 156,
    " b": 16,
    "be": 162,
    " be": 19,
    "be ": 163,
    " be ": 20,
    " r": 74,
    "ri": 485,
    "ig": 331,
    "gh": 275,
    "ht": 319,
    " ri": 78,
    "rig": 491,
    "igh": 332,
    "ght": 278,
    "ht ": 320,
    " rig": 79,
    "righ": 492,
    "ight": 333,
    "ght ": 279,
    "k": 351,
    " o": 69,
    "ok": 431,
    "k ": 352,
    " ok": 70,
    "ok ": 432,
    " ok ": 71,
    "gr": 283,
    " gr": 46,
    "gre": 286,
    "rea": 476,
    "eat": 217,
    " gre": 47,
    "grea": 287,
    "reat": 478,
    "eat ": 218,
    ",": 103,
    " ,": 1,
    ", ": 104,
    " , ": 2,
    "an": 132,
    "nk": 412,
    "han": 293,
    "ank": 137,
    "nk ": 413,
    "than": 530,
    "hank": 295,
    "ank ": 138,
    "u": 540,
    "yo": 567,
    "ou": 454,
    "u ": 541,
    " yo": 101,
    "you": 568,
    "ou ": 455,
    " you": 102,
    "you ": 569,
    "c": 167,
    " c": 23,
    "co": 184,
    "rr": 501,
    "ec": 219,
    "ct": 189,
    " co": 27,
    "cor": 187,
    "orr": 449,
    "rre": 502,
    "rec": 479,
    "ect": 220,
    "ct ": 190,
    " cor": 29,
    "corr": 188,
    "orre": 450,
    "rrec": 503,
    "rect": 480,
    "ect ": 221,
    "ch": 176,
    "oi": 428,
    "ic": 325,
    "ce": 174,
    " ch": 24,
    "cho": 179,
    "hoi": 315,
    "oic": 429,
    "ice": 329,
    "ce ": 175,
    " cho": 26,
    "choi": 180,
    "hoic": 316,
    "oice": 430,
    "ice ": 330,
    "so": 515,
    "un": 542,
    " so": 87,
    "sou": 516,
    "oun": 456,
    "und": 543,
    "nd ": 398,
    " sou": 88,
    "soun": 517,
    "ound": 457,
    "und ": 544,
    "al": 120,
    "ly": 375,
    " re": 75,
    "eal": 213,
    "all": 125,
    "lly": 369,
    "ly ": 376,
    " rea": 76,
    "real": 477,
    "eall": 214,
    "ally": 126,
    "lly ": 370,
    "by": 164,
    " by": 21,
    "bye": 165,
    "ye ": 560,
    " bye": 22,
    "bye ": 166,
    "db": 195,
    "odb": 423,
    "dby": 196,
    "oodb": 440,
    "odby": 424,
    "dbye": 197,
    "se": 509,
    " se": 83,
    "see": 510,
    "ee ": 225,
    " see": 84,
    "see ": 511,
    "cu": 191,
    " cu": 30,
    "cu ": 192,
    " cu ": 31,
    "ao": 139,
    "cha": 177,
    "hao": 296,
    "ao ": 140,
    " cha": 25,
    "chao": 178,
    "hao ": 297,
    "av": 153,
    " ha": 49,
    "hav": 300,
    "ave": 154,
    "ve ": 547,
    " hav": 50,
    "have": 301,
    "ave ": 155,
    " a": 5,
    "a ": 108,
    " a ": 6,
    "on": 433,
    "ne": 401,
    " on": 72,
    "one": 435,
    "ne ": 402,
    " one": 73,
    "one ": 436,
    " w": 93,
    "wh": 554,
    " wh": 94,
    "wha": 555,
    " wha": 95,
    "what": 556,
    "ba": 157,
    "ac": 109,
    "ck": 181,
    "kg": 353,
    "ro": 496,
    " ba": 17,
    "bac": 158,
    "ack": 110,
    "ckg": 182,
    "kgr": 354,
    "gro": 288,
    "rou": 499,
    " bac": 18,
    "back": 159,
    "ackg": 111,
    "ckgr": 183,
    "kgro": 355,
    "grou": 289,
    "roun": 500,
    "f": 258,
    " f": 38,
    "fo": 265,
    " fo": 39,
    "for": 266,
    "or ": 444,
    " for": 40,
    "for ": 267,
    "af": 112,
    "fg": 262,
    "is": 348,
    "st": 518,
    "ta": 523,
    "n ": 390,
    " af": 7,
    "afg": 113,
    "fgh": 263,
    "gha": 276,
    "ani": 134,
    "nis": 410,
    "ist": 349,
    "sta": 519,
    "tan": 524,
    "an ": 133,
    " afg": 8,
    "afgh": 114,
    "fgha": 264,
    "ghan": 277,
    "hani": 294,
    "anis": 136,
    "nist": 411,
    "ista": 350,
    "stan": 520,
    "tan ": 525,
    "?": 105,
    " ?": 3,
    "? ": 106,
    " ? ": 4,
    "he ": 303,
    "the ": 533,
    " l": 61,
    "oc": 418,
    "ca": 169,
    "ti": 535,
    "io": 341,
    " lo": 62,
    "loc": 373,
    "oca": 419,
    "cat": 172,
    "ati": 151,
    "tio": 536,
    "ion": 342,
    "on ": 434,
    " loc": 63,
    "loca": 374,
    "ocat": 420,
    "cati": 173,
    "atio": 152,
    "tion": 537,
    "ion ": 343,
    "ge": 270,
    "eo": 239,
    "og": 425,
    "ra": 468,
    "ap": 141,
    "ph": 463,
    "c ": 168,
    " ge": 42,
    "geo": 271,
    "eog": 240,
    "ogr": 426,
    "gra": 284,
    "rap": 469,
    "aph": 143,
    "phi": 464,
    "hic": 312,
    "ic ": 326,
    " geo": 43,
    "geog": 272,
    "eogr": 241,
    "ogra": 427,
    "grap": 285,
    "raph": 470,
    "aphi": 144,
    "phic": 465,
    "hic ": 313,
    "rd": 471,
    "di": 203,
    "na": 391,
    "te": 526,
    "coo": 185,
    "oor": 441,
    "ord": 445,
    "rdi": 472,
    "din": 204,
    "ina": 335,
    "nat": 392,
    "ate": 149,
    "te ": 527,
    " coo": 28,
    "coor": 186,
    "oord": 442,
    "ordi": 446,
    "rdin": 473,
    "dina": 205,
    "inat": 336,
    "nate": 393,
    "ate ": 150,
    "ma": 378,
    " ma": 65,
    "map": 379,
    "ap ": 142,
    " map": 66,
    "map ": 380,
    "ef": 228,
    "fe": 259,
    "nc": 394,
    "ref": 481,
    "efe": 229,
    "fer": 260,
    "ren": 483,
    "enc": 235,
    "nce": 395,
    " ref": 77,
    "refe": 482,
    "efer": 230,
    "fere": 261,
    "eren": 247,
    "renc": 484,
    "ence": 236,
    "nce ": 396,
    "ak": 117,
    "kr": 356,
    "ot": 451,
    " ak": 9,
    "akr": 118,
    "kro": 357,
    "rot": 497,
    "oti": 452,
    "tir": 538,
    "iri": 346,
    "ri ": 486,
    " akr": 10,
    "akro": 119,
    "krot": 358,
    "roti": 498,
    "otir": 453,
    "tiri": 539,
    "iri ": 347,
    "lb": 360,
    "ia": 323,
    " al": 11,
    "alb": 121,
    "lba": 361,
    "ban": 160,
    "nia": 406,
    "ia ": 324,
    " alb": 12,
    "alba": 122,
    "lban": 362,
    "bani": 161,
    "ania": 135,
    "nia ": 407,
    "lg": 363,
    "alg": 123,
    "lge": 364,
    "ger": 273,
    "eri": 248,
    "ria": 487,
    " alg": 13,
    "alge": 124,
    "lger": 365,
    "geri": 274,
    "eria": 249,
    "ria ": 488,
    "am": 127,
    "me": 381,
    " am": 14,
    "ame": 128,
    "mer": 382,
    "ric": 489,
    "ica": 327,
    "can": 170,
    " ame": 15,
    "amer": 129,
    "meri": 383,
    "eric": 250,
    "rica": 490,
    "ican": 328,
    "can ": 171,
    "sa": 506,
    "oa": 416,
    " sa": 81,
    "sam": 507,
    "amo": 130,
    "moa": 385,
    "oa ": 417,
    " sam": 82,
    "samo": 508,
    "amoa": 131,
    "moa ": 386
  },
  "response": null,
  "action_text": null
}