{
    "8.1 - 8.2": "Arjun said: O Supreme Lord, what is Brahman (Absolute Reality), what is adhyatma (the individual soul), and what is karma? What is said to be adhibhuta, and who is said to be Adhidaiva? Who is Adhiyajna in the body and how is He the Adhiyajna? O Krishna, how are You to be known at the time of death by those of steadfast mind?",
    "8.3": "The Lord said: The Supreme Indestructible Entity is called Brahman; one’s own self is called adhyatma. Actions pertaining to the material personality of living beings, and its development are called karma, or fruitive activities.",
    "8.4": "O best of the embodied souls, the physical manifestation that is constantly changing is called adhibhūta; the universal form of God, which presides over the celestial gods in this creation, is called Adhidaiva; I, who dwell in the heart of every living being, am called Adhiyajna, or the Lord of all sacrifices.",
    "8.5": "Those who relinquish the body while remembering Me at the moment of death will come to Me. There is certainly no doubt about this.",
    "8.6": "Whatever one remembers upon giving up the body at the time of death, O son of Kunti, one attains that state, being always absorbed in such contemplation.",
    "8.7": "Therefore, always remember Me and also do your duty of fighting the war. With mind and intellect surrendered to Me, you will definitely attain Me; of this, there is no doubt.",
    "8.8": "With practice, O Parth, when you constantly engage the mind in remembering Me, the Supreme Divine Personality, without deviating, you will certainly attain Me.",
    "8.9 - 8.10": "God is Omniscient, the most ancient One, the Controller, subtler than the subtlest, the Support of all, and the possessor of an inconceivable divine form; He is brighter than the sun, and beyond all darkness of ignorance. One who at the time of death, with unmoving mind attained by the practice of Yog, fixes the prāṇ (life-airs) between the eyebrows, and steadily remembers the Divine Lord with great devotion, certainly attains Him.",
    "8.11": "Scholars of the Vedas describe Him as Imperishable; great ascetics practice the vow of celibacy and renounce worldly pleasures to enter into Him. I shall now explain to you briefly the path to that goal.",
    "8.12": "Restraining all the gates of the body and fixing the mind in the heart region, and then drawing the life-breath to the head, one should get established in steadfast yogic concentration.",
    "8.13": "One who departs from the body while remembering Me, the Supreme Personality, and chanting the syllable Om, will attain the supreme goal.",
    "8.14": "O Parth, for those yogis who always think of Me with exclusive devotion, I am easily attainable because of their constant absorption in Me.",
    "8.15": "Having attained Me, the great souls are no more subject to rebirth in this world, which is transient and full of misery, because they have attained the highest perfection.",
    "8.16": "In all the worlds of this material creation, up to the highest abode of Brahma, you will be subject to rebirth, O Arjun. But on attaining My Abode, O son of Kunti, there is no further rebirth.",
    "8.17": "One day of Brahma (kalp) lasts a thousand cycles of the four ages (mahā yug) and his night also extends for the same span of time. The wise who know this understand the reality about day and night.",
    "8.18": "At the advent of Brahma’s day, all living beings emanate from the unmanifest source. And at the fall of his night, all embodied beings again merge into their unmanifest source.",
    "8.19": "Multitudes of beings repeatedly take birth with the advent of Brahma’s day, and are reabsorbed on the arrival of the cosmic night, to manifest again automatically on the advent of the next cosmic day.",
    "8.20": "Transcendental to this manifest and unmanifest creation, there is yet another unmanifest eternal dimension. That realm does not cease even when all others do.",
    "8.21": "That unmanifest dimension is the supreme goal, and upon reaching it, one never returns to this mortal world. That is My Supreme Abode.",
    "8.22": "The Supreme Divine Personality is greater than all that exists. Although He is all-pervading and all living beings are situated in Him, yet He can be known only through devotion.",
    "8.23 - 8.26": "I shall now describe to you the different paths of passing away from this world, O best of the Bharatas, one of which leads to liberation and the other leads to rebirth. Those who know the Supreme Brahman and who depart from this world, during the six months of the sun’s northern course, the bright fortnight of the moon, and the bright part of the day, attain the supreme destination. The practitioners of Vedic rituals, who pass away during the six months of the sun’s southern course, the dark fortnight of the moon, the time of smoke, the night, attain the celestial abodes. After enjoying celestial pleasures, they again return to the earth. These two, bright and dark paths, always exist in this world. The way of light leads to liberation and the way of darkness leads to rebirth.",
    "8.27": "Yogis who know the secret of these two paths, O Parth, are never bewildered. Therefore, at all times be situated in Yog (union with God).",
    "8.28": "The yogis, who know this secret, gain merit far beyond the fruits of Vedic rituals, the study of the Vedas, performance of sacrifices, austerities, and charities. Such yogis reach the Supreme Abode.",
    "14.1": "The Divine Lord said: I shall once again explain to you the supreme wisdom, the best of all knowledge; by knowing which, all the great saints attained the highest perfection.",
    "14.2": "Those who take refuge in this wisdom will be united with Me. They will not be reborn at the time of creation nor destroyed at the time of dissolution.",
    "14.3 - 14.4": "The total material substance, prakṛiti, is the womb. I impregnate it with the individual souls, and thus all living beings are born. O son of Kunti, for all species of life that are produced, the material nature is the womb, and I am the seed-giving Father.",
    "14.5": "O mighty-armed Arjun, the material energy consists of three guṇas (modes)—sattva (goodness), rajas (passion), and tamas (ignorance). These modes bind the eternal soul to the perishable body.",
    "14.6": "Amongst these, sattva guṇa, the mode of goodness, being purer than the others, is illuminating and full of well-being. O sinless one, it binds the soul by creating attachment for a sense of happiness and knowledge.",
    "14.7": "O Arjun, rajo guṇa is of the nature of passion. It arises from worldly desires and affections, and binds the soul through attachment to fruitive actions.",
    "14.8": "O Arjun, tamo guṇa, which is born of ignorance, is the cause of illusion for the embodied souls. It deludes all living beings through negligence, laziness, and sleep.",
    "14.9": "Sattva binds one to material happiness; rajas conditions the soul toward actions; and tamas clouds wisdom and binds one to delusion.",
    "14.10": "Sometimes goodness (sattva) prevails over passion (rajas) and ignorance (tamas), O scion of Bharat. Sometimes passion (rajas) dominates goodness (sattva) and ignorance (tamas), and at other times ignorance (tamas) overcomes goodness (sattva) and passion (rajas).",
    "14.11 - 14.13": "When all the gates of the body are illumined by knowledge, know it to be a manifestation of the mode of goodness. When the mode of passion predominates, O Arjun, the symptoms of greed, exertion for worldly gain, restlessness, and craving develop. O Arjun, nescience, inertia, negligence, and delusion—these are the dominant signs of the mode of ignorance.",
    "14.14 - 14.15": "Those who die with predominance of sattva reach the pure abodes (which are free from rajas and tamas) of the learned. Those who die with prevalence of the mode of passion are born among people driven by work, while those dying in the mode of ignorance take birth in the animal kingdom.",
    "14.16": "It is said the fruit of actions performed in the mode of goodness bestow pure results. Actions done in the mode of passion result in pain, while those performed in the mode of ignorance result in darkness.",
    "14.17": "From the mode of goodness arises knowledge, from the mode of passion arises greed, and from the mode of ignorance arise negligence and delusion.",
    "14.18": "Those situated in the mode of goodness rise upward; those in the mode of passion stay in the middle; and those in the mode of ignorance go downward.",
    "14.19": "When wise persons see that in all work there is no agent of action other than the three guṇas, and they know Me to be transcendental to these guṇas, they attain My divine nature.",
    "14.20": "By transcending the three modes of material nature associated with the body, one becomes free from birth, death, old age, and misery, and attains immortality.",
    "14.21": "Arjun inquired: What are the characteristics of those who have gone beyond the three guṇas, O Lord? How do they act? How do they go beyond the bondage of the guṇas?",
    "14.22 - 14.23": "The Supreme Divine Personality said: O Arjun, The persons who are transcendental to the three guṇas neither hate illumination (which is born of sattva), nor activity (which is born of rajas), nor even delusion (which is born of tamas), when these are abundantly present, nor do they long for them when they are absent. They remain neutral to the modes of nature and are not disturbed by them. Knowing it is only the guṇas that act, they stay established in the self, without wavering.",
    "14.24 - 14.25": "Those who are alike in happiness and distress; who are established in the self; who look upon a clod, a stone, and a piece of gold as of equal value; who remain the same amidst pleasant and unpleasant events; who are intelligent; who accept both blame and praise with equanimity; who remain the same in honor and dishonor; who treat both friend and foe alike; and who have abandoned all enterprises – they are said to have risen above the three guṇas.",
    "14.26": "Those who serve Me with unalloyed devotion rise above the three modes of material nature and come to the level of the Brahman.",
    "14.27": "I am the basis of the formless Brahman, the immortal and imperishable, of eternal dharma, and of unending divine bliss.",
    "4.1": "The Supreme Lord Shree Krishna said: I taught this eternal science of Yog to the Sun God, Vivasvan, who passed it on to Manu; and Manu, in turn, instructed it to Ikshvaku.",
    "4.2": "O subduer of enemies, the saintly kings thus received this science of Yog in a continuous tradition. But with the long passage of time, it was lost to the world.",
    "4.3": "The same ancient knowledge of Yog, which is the supreme secret, I am today revealing unto you, because you are My friend as well as My devotee, who can understand this transcendental wisdom.",
    "4.4": "Arjun said: You were born much after Vivasvan. How am I to understand that in the beginning You instructed this science to him?",
    "4.5": "The Supreme Lord said: Both you and I have had many births, O Arjun. You have forgotten them, while I remember them all, O Parantapa.",
    "4.6": "Although I am unborn, the Lord of all living entities, and have an imperishable nature, yet I appear in this world by virtue of Yogmaya, My divine power.",
    "4.7": "Whenever there is a decline in righteousness and an increase in unrighteousness, O Arjun, at that time I manifest Myself on earth.",
    "4.8": "To protect the righteous, to annihilate the wicked, and to reestablish the principles of dharma I appear on this earth, age after age.",
    "4.9": "Those who understand the divine nature of My birth and activities, O Arjun, upon leaving the body, do not have to take birth again, but come to My eternal abode.",
    "4.10": "Being free from attachment, fear, and anger, becoming fully absorbed in Me, and taking refuge in Me, many persons in the past became purified by knowledge of Me, and thus attained My divine love.",
    "4.11": "In whatever way people surrender unto Me, I reciprocate accordingly. Everyone follows My path, knowingly or unknowingly, O son of Pritha.",
    "4.12": "In this world, those desiring success in material activities worship the celestial gods, since material rewards manifest quickly.",
    "4.13": "The four categories of occupations were created by Me according to people’s qualities and activities. Although I am the Creator of this system, know Me to be the Non-doer and Eternal.",
    "4.14": "Activities do not taint Me, nor do I desire the fruits of action. One who knows Me in this way is never bound by the karmic reactions of work.",
    "4.15": "Knowing this truth, even seekers of liberation in ancient times performed actions. Therefore, following the footsteps of those ancient sages, you too should perform your duty.",
    "4.16": "What is action and what is inaction? Even the wise are confused in determining this. Now I shall explain to you the secret of action, by knowing which, you may free yourself from material bondage.",
    "4.17": "You must understand the nature of all three—recommended action, wrong action, and inaction. The truth about these is profound and difficult to understand.",
    "4.18": "Those who see action in inaction and inaction in action are truly wise amongst humans. Although performing all kinds of actions, they are yogis and masters of all their actions.",
    "4.19": "The enlightened sages call those persons wise, whose every action is free from the desire for material pleasures and who have burnt the reactions of work in the fire of divine knowledge.",
    "4.20": "Such people, having given up attachment to the fruits of their actions, are always satisfied and not dependent on external things. Despite engaging in activities, they do not do anything at all.",
    "4.21": "Free from expectations and the sense of ownership, with the mind and intellect fully controlled, they incur no sin even though performing actions by their body.",
    "4.22": "Content with whatever gain comes of its own accord, and free from envy, they are beyond the dualities of life. Being equipoised in success and failure, they are not bound by their actions, even while performing all kinds of activities.",
    "4.23": "They are released from the bondage of material attachments and their intellect is established in divine knowledge. Since they perform all actions as a sacrifice (to God), they are freed from all karmic reactions.",
    "4.24": "For those who are completely absorbed in God-consciousness, the oblation is Brahman, the ladle with which it is offered is Brahman, the act of offering is Brahman, and the sacrificial fire is also Brahman. Such persons, who view everything as God, easily attain Him.",
    "4.25": "Some yogis worship the celestial gods with material offerings unto them. Others worship perfectly who offer the self as sacrifice in the fire of the Supreme Truth.",
    "4.26": "Others offer hearing and other senses in the sacrificial fire of restraint. Still others offer sound and other objects of the senses as sacrifice in the fire of the senses.",
    "4.27": "Some, inspired by knowledge, offer the functions of all their senses and their life energy in the fire of the controlled mind.",
    "4.28": "Some offer their wealth as sacrifice, while others offer severe austerities as sacrifice. Some practice the eight-fold path of yogic practices, and yet others study the scriptures and cultivate knowledge as sacrifice, while observing strict vows.",
    "4.29 - 4.30": "Still others offer as sacrifice the outgoing breath in the incoming breath, while some offer the incoming breath into the outgoing breath. Some arduously practice prāṇāyām and restrain the incoming and outgoing breaths, purely absorbed in the regulation of the life-energy. Yet others curtail their food intake and offer the breath into the life-energy as sacrifice. All these knowers of sacrifice are cleansed of their impurities as a result of such performances.",
    "4.31": "Those who know the secret of sacrifice, and engaging in it, partake of its remnants that are like nectar, advance toward the Absolute Truth. O best of the Kurus, those who perform no sacrifice find no happiness either in this world or the next.",
    "4.32": "All these different kinds of sacrifice have been described in the Vedas. Know them as originating from different types of work; this understanding cuts the knots of material bondage",
    "4.33": "O subduer of enemies, sacrifice performed in knowledge is superior to any mechanical material sacrifice. After all, O Parth, all sacrifices of work culminate in knowledge.",
    "4.34": "Learn the Truth by approaching a spiritual master. Inquire from him with reverence and render service unto him. Such an enlightened Saint can impart knowledge unto you because he has seen the Truth.",
    "4.35": "Following this path and having achieved enlightenment from a Guru, O Arjun, you will no longer fall into delusion. In the light of that knowledge, you will see that all living beings are but parts of the Supreme, and are within Me.",
    "4.36": "Even those who are considered the most immoral of all sinners can cross over this ocean of material existence by seating themselves in the boat of divine knowledge.",
    "4.37": "As a kindled fire reduces wood to ashes, O Arjun, so does the fire of knowledge burn to ashes all reactions from material activities.",
    "4.38": "In this world, there is nothing as purifying as divine knowledge. One who has attained purity of mind through prolonged practice of Yog, receives such knowledge within the heart, in due course of time.",
    "4.39": "Those whose faith is deep and who have practiced controlling their mind and senses attain divine knowledge. Through such transcendental knowledge, they quickly attain everlasting supreme peace.",
    "4.40": "But persons who possess neither faith nor knowledge, and who are of a doubting nature, suffer a downfall. For the skeptical souls, there is no happiness either in this world or the next.",
    "4.41": "O Arjun, actions do not bind those who have renounced karm in the fire of Yog, whose doubts have been dispelled by knowledge, and who are situated in knowledge of the self.",
    "4.42": "Therefore, with the sword of knowledge, cut asunder the doubts that have arisen in your heart. O scion of Bharat, establish yourself in karm yog. Arise, stand up, and take action!",
    "18.1": "Arjun said: O mighty-armed Krishna, I wish to understand the nature of sanyās (renunciation of actions) and tyāg (renunciation of desire for the fruits of actions). O Hrishikesh, I also wish to know the distinction between the two, O Keshinisudan.",
    "18.2": "The Supreme Divine Personality said: Giving up of actions motivated by desire is what the wise understand as sanyās. Relinquishing the fruits of all actions is what the learned declare to be tyāg.",
    "18.3": "Some learned people declare that all kinds of actions should be given up as evil, while others maintain that acts of sacrifice, charity, and penance should never be abandoned.",
    "18.4": "Now hear My conclusion on the subject of renunciation, O tiger amongst men, for renunciation has been declared to be of three kinds.",
    "18.5": "Actions based upon sacrifice, charity, and penance should never be abandoned; they must certainly be performed. Indeed, acts of sacrifice, charity, and penance are purifying even for those who are wise.",
    "18.6": "These activities must be performed without attachment and expectation for rewards. This is My definite and supreme verdict, O Arjun.",
    "18.7": "Prescribed duties should never be renounced. Such deluded renunciation is said to be in the mode of ignorance.",
    "18.8": "To give up prescribed duties because they are troublesome or cause bodily discomfort is renunciation in the mode of passion. Such renunciation is never beneficial or elevating.",
    "18.9": "When actions are undertaken in response to duty, and one relinquishes attachment to any reward, O Arjun, it is considered renunciation in the nature of goodness.",
    "18.10": "Those who neither avoid disagreeable work nor seek work because it is agreeable are persons of true renunciation. They are endowed with the quality of the mode of goodness and have no doubts (about the nature of work).",
    "18.11": "For the embodied being, it is impossible to give up activities entirely. But those who relinquish the fruits of their actions are said to be truly renounced.",
    "18.12": "The three-fold fruits of actions—pleasant, unpleasant, and mixed—accrue even after death to those who are attached to personal reward. But, for those who renounce the fruits of their actions, there are no such results in the here or hereafter.",
    "18.13": "O Arjun, now learn from Me about the five factors that have been mentioned for the accomplishment of all actions in the doctrine of Sānkhya, which explains how to stop the reactions of karmas.",
    "18.14": "The body, the doer (soul), the various senses, the many kinds of efforts, and Divine Providence—these are the five factors of action.",
    "18.15 - 18.16": "These five are the contributory factors for whatever action is performed, whether proper or improper, with body, speech, or mind. Those who do not understand this regard the soul as the only doer. With their impure intellects they cannot see things as they are.",
    "18.17": "Those who are free from the ego of being the doer, and whose intellect is unattached, though they may slay living beings, they neither kill nor are they bound by actions.",
    "18.18": "Knowledge, the object of knowledge, and the knower—these are the three factors that induce action. The instrument of action, the act itself, and the doer—these are the three constituents of action.",
    "18.19": "Knowledge, action, and the doer are declared to be of three kinds in the Sānkhya philosophy, distinguished according to the three modes of material nature. Listen, and I will explain their distinctions to you.",
    "18.20": "Understand that knowledge to be in the mode of goodness by which a person sees one undivided imperishable reality within all diverse living beings.",
    "18.21": "That knowledge is to be considered in the mode of passion by which one sees manifold living entities in diverse bodies as individual and unconnected.",
    "18.22": "That knowledge is said to be in the mode of ignorance where one is engrossed in a fragmental concept as if it encompasses the whole, and which is neither grounded in reason nor based on the truth.",
    "18.23": "Action that is in accordance with the scriptures, free from attachment and aversion, and done without desire for rewards, is in the mode of goodness.",
    "18.24": "Action that is prompted by selfish desire, enacted with pride, and full of stress, is in the nature of passion.",
    "18.25": "That action is declared to be in the mode of ignorance, which is begun out of delusion, without thought to one’s own ability, and disregarding consequences, loss, and injury to others.",
    "18.26": "The performer is said to be in the mode of goodness, when he or she is free from egotism and attachment, endowed with enthusiasm and determination, and equipoised in success and failure.",
    "18.27": "The performer is considered in the mode of passion when he or she craves the fruits of the work, is covetous, violent-natured, impure, and moved by joy and sorrow.",
    "18.28": "A performer in the mode of ignorance is one who is undisciplined, vulgar, stubborn, deceitful, slothful, despondent, and a procrastinator.",
    "18.29": "Hear now, O Arjun, of the distinctions of intellect and determination, according to the three modes of material nature, as I describe them in detail.",
    "18.30": "The intellect is said to be in the nature of goodness, O Parth, when it understands what is proper action and improper action, what is duty and non-duty, what is to be feared and what is not to be feared, what is binding and what is liberating.",
    "18.31": "The intellect is considered in the mode of passion when it is confused between righteousness and unrighteousness, and cannot distinguish between right and wrong conduct, O Parth.",
    "18.32": "That intellect which is shrouded in darkness, imagining irreligion to be religion, and perceiving untruth to be the truth, is of the nature of ignorance, O Parth.",
    "18.33": "The steadfast willpower that is developed through Yog, and which sustains the activities of the mind, the life-airs, and the senses, O Parth, is said to be determination in the mode of goodness.",
    "18.34": "The steadfast willpower by which one holds on to duty, pleasures, and wealth, out of attachment and desire for rewards, O Arjun, is determination in the mode of passion.",
    "18.35": "That unintelligent resolve is said to be determination in the mode of ignorance, in which one does not give up dreaming, fearing, grieving, despair, and conceit.",
    "18.36": "Now hear from Me, O Arjun, of the three kinds of happiness in which the embodied soul rejoices, and can even reach the end of all suffering.",
    "18.37": "That which seems like poison at first, but tastes like nectar in the end, is said to be happiness in the mode of goodness. It is generated by the pure intellect that is situated in self-knowledge.",
    "18.38": "Happiness is said to be in the mode of passion when it is derived from the contact of the senses with their objects. Such happiness is like nectar at first but poison at the end.",
    "18.39": "That happiness which covers the nature of the self from beginning to end, and which is derived from sleep, indolence, and negligence, is said to be in the mode of ignorance.",
    "18.40": "No living being on earth or the higher celestial abodes of this material realm is free from the influence of these three modes of nature.",
    "18.41": "The duties of the Brahmins, Kshatriyas, Vaishyas, and Shudras—are distributed according to their qualities, in accordance with their guṇas (and not by birth).",
    "18.42": "Tranquility, restraint, austerity, purity, patience, integrity, knowledge, wisdom, and belief in a hereafter—these are the intrinsic qualities of work for Brahmins.",
    "18.43": "Valor, strength, fortitude, skill in weaponry, resolve never to retreat from battle, large-heartedness in charity, and leadership abilities, these are the natural qualities of work for Kshatriyas.",
    "18.44": "Agriculture, dairy farming, and commerce are the natural works for those with the qualities of Vaishyas. Serving through work is the natural duty for those with the qualities of Shudras.",
    "18.45": "By fulfilling their duties, born of their innate qualities, human beings can attain perfection. Now hear from Me how one can become perfect by discharging one’s prescribed duties.",
    "18.46": "By performing one’s natural occupation, one worships the Creator from whom all living entities have come into being, and by whom the whole universe is pervaded. By such performance of work, a person easily attains perfection.",
    "18.47": "It is better to do one’s own dharma, even though imperfectly, than to do another’s dharma, even though perfectly. By doing one’s innate duties, a person does not incur sin.",
    "18.48": "One should not abandon duties born of one’s nature, even if one sees defects in them, O son of Kunti. Indeed, all endeavors are veiled by some evil, as fire is by smoke.",
    "18.49": "Those whose intellect is unattached everywhere, who have mastered the mind, and are free from desires by the practice of renunciation, attain the highest perfection of freedom from action.",
    "18.50": "Hear from Me briefly, O Arjun, and I shall explain how one, who has attained perfection (of cessation of actions), can also attain Brahman by being firmly fixed in transcendental knowledge.",
    "18.51 - 18.53": "One becomes fit to attain Brahman when he or she possesses a purified intellect and firmly restrains the senses, abandoning sound and other objects of the senses, casting aside attraction and aversion. Such a person relishes solitude, eats lightly, controls body, mind, and speech, is ever engaged in meditation, and practices dispassion. Free from egotism, violence, arrogance, desire, possessiveness of property, and selfishness, such a person, situated in tranquility, is fit for union with Brahman (i.e., realization of the Absolute Truth as Brahman).",
    "18.54": "One situated in the transcendental Brahman realization becomes mentally serene, neither grieving nor desiring. Being equitably disposed toward all living beings, such a yogi attains supreme devotion unto Me.",
    "18.55": "Only by loving devotion to Me does one come to know who I am in Truth. Then, having come to know Me, My devotee enters into full consciousness of Me.",
    "18.56": "My devotees, though performing all kinds of actions, take full refuge in Me. By my grace, they attain the eternal and imperishable abode.",
    "18.57": "Dedicate your every activity to Me, making Me your supreme goal. Taking shelter of the Yog of the intellect, keep your consciousness absorbed in Me always.",
    "18.58": "If you always remember Me, by My grace you shall overcome all obstacles and difficulties. But if, due to pride, you do not listen to My advice, you will perish.",
    "18.59": "If, motivated by pride, you think, “I shall not fight,” your decision will be in vain. Your own nature will compel you to fight.",
    "18.60": "O Arjun, that action which out of delusion you do not wish to do, you will be driven to do it by your own inclination, born of your own material nature.",
    "18.61": "The Supreme Lord dwells in the hearts of all living beings, O Arjun. According to their karmas, He directs the wanderings of the souls, who are seated on a machine made of material energy.",
    "18.62": "Surrender exclusively unto Him with your whole being, O Bharat. By His grace, you will attain perfect peace and the eternal abode.",
    "18.63": "Thus, I have explained to you this knowledge that is more secret than all secrets. Ponder over it deeply, and then do as you wish.",
    "18.64": "Hear again My supreme instruction, the most confidential of all knowledge. I am revealing this for your benefit because you are very dear to Me.",
    "18.65": "Always think of Me, be devoted to Me, worship Me, and offer obeisance to Me. Doing so, you will certainly come to Me. This is My pledge to you, for you are very dear to Me.",
    "18.66": "Abandon all varieties of dharmas and simply surrender unto Me alone. I shall liberate you from all sinful reactions; do not fear.",
    "18.67": "This instruction should never be explained to those who are not austere or to those who are not devoted. It should also not be spoken to those who are averse to listening (to spiritual topics), and especially not to those who are envious of Me.",
    "18.68": "Amongst My devotees, those who teach this most confidential knowledge perform the greatest act of love. They will come to Me, without doubt.",
    "18.69": "No human being does more loving service to Me than they; nor shall there ever be anyone on this earth more dear to Me.",
    "18.70": "And I proclaim that those who study this sacred dialogue of ours will worship Me (with their intellect) through the sacrifice of knowledge; such is My view.",
    "18.71": "Even those who only listen to this knowledge with faith and without envy will be liberated from sins and attain the auspicious abodes where the pious dwell.",
    "18.72": "O Arjun, have you heard Me with a concentrated mind? Have your ignorance and delusion been destroyed?",
    "18.73": "Arjun said: O Infallible One, by your grace my illusion has been dispelled, and I am situated in knowledge. I am now free from doubts, and I shall act according to Your instructions.",
    "18.74": "Sanjay said: Thus, have I heard this wonderful conversation between Shree Krishna, the Son of Vasudev, and Arjun, the noble-hearted son of Pritha. So thrilling is the message that my hair is standing on end.",
    "18.75": "By the grace of Veda Vyas, I have heard this supreme and most secret Yog from the Lord of Yog, Shree Krishna Himself.",
    "18.76": "As I repeatedly recall this astonishing and wonderful dialogue between the Supreme Lord Shree Krishna and Arjun, O King, I rejoice again and again.",
    "18.77": "And remembering that most astonishing and wonderful cosmic form of Lord Krishna, great is my astonishment, and I am thrilled with joy over and over again.",
    "18.78": "Wherever there is Shree Krishna, the Lord of all Yog, and wherever there is Arjun, the supreme archer, there will also certainly be unending opulence, victory, prosperity, and righteousness. Of this, I am certain.",
    "5.1": "Arjun said: O Shree Krishna, You praised karm sanyās (the path of renunciation of actions), and You also advised to do karm yog (work with devotion). Please tell me decisively which of the two is more beneficial?",
    "5.2": "The Supreme Lord said: Both the path of karm sanyās (renunciation of actions) and karm yog (working in devotion) lead to the supreme goal. But karm yog is superior to karm sanyās.",
    "5.3": "The karm yogis, who neither desire nor hate anything, should be considered always renounced. Free from all dualities, they are easily liberated from the bonds of material energy",
    "5.4": "Only the ignorant speak of sānkhya (renunciation of actions, or karm sanyās) and karm yog (work in devotion) as different. Those who are truly learned say that by applying ourselves to any one of these paths, we can achieve the results of both.",
    "5.5": "The supreme state that is attained by means of karm sanyās is also attained by working in devotion. Hence, those who see karm sanyās and karm yog to be identical, truly see things as they are.",
    "5.6": "Perfect renunciation (karm sanyās) is difficult to attain without performing work in devotion (karm yog), O mighty-armed Arjun, but the sage who is adept in karm yog quickly attains the Supreme.",
    "5.7": "The karm yogis, who are of purified intellect, and who control the mind and senses, see the Soul of all souls in every living being. Though performing all kinds of actions, they are never entangled.",
    "5.8 - 5.9": "Those steadfast in karm yog, always think, “I am not the doer,” even while engaged in seeing, hearing, touching, smelling, moving, sleeping, breathing, speaking, excreting, grasping, and opening or closing the eyes. With the light of divine knowledge, they see that it is only the material senses that are moving amongst their objects.",
    "5.10": "Those who dedicate their actions to God, abandoning all attachment, remain untouched by sin, just as a lotus leaf is untouched by water.",
    "5.11": "The yogis, while giving up attachment, perform actions with their body, senses, mind, and intellect, only for the purpose of self-purification.",
    "5.12": "Offering the results of all activities to God, the karm yogis attain everlasting peace. Whereas those who, being impelled by their desires, work with a selfish motive become entangled because they are attached to the fruits of their actions.",
    "5.13": "The embodied beings who are self-controlled and detached reside happily in the city of nine gates free from thoughts that they are the doers or the cause of anything.",
    "5.14": "Neither the sense of doership nor the nature of actions comes from God; nor does He create the fruits of actions. All this is enacted by the modes of material nature (guṇas).",
    "5.15": "The omnipresent God does not involve Himself in the sinful or virtuous deeds of anyone. The living entities are deluded because their inner knowledge is covered by ignorance.",
    "5.16": "But for those whose ignorance is destroyed by divine knowledge, the Supreme Entity is revealed, just as the sun illumines everything when it rises.",
    "5.17": "Those whose intellect is fixed in God, who are completely absorbed in God, with firm faith in Him as the supreme goal, such persons quickly reach the state from which there is no return, their sins having been dispelled by the light of knowledge.",
    "5.18": "The truly learned, with the eyes of divine knowledge, see with equal vision a Brahmin, a cow, an elephant, a dog, and a dog-eater.",
    "5.19": "Those whose minds are established in equality of vision conquer the cycle of birth and death in this very life. They possess the flawless qualities of God, and are therefore seated in the Absolute Truth.",
    "5.20": "Established in God, having a firm understanding of divine knowledge and not hampered by delusion, they neither rejoice in getting something pleasant nor grieve on experiencing the unpleasant.",
    "5.21": "Those who are not attached to external sense pleasures realize divine bliss in the self. Being united with God through Yog, they experience unending happiness.",
    "5.22": "The pleasures that arise from contact with the sense objects, though appearing as enjoyable to worldly-minded people, are verily a source of misery. O son of Kunti, such pleasures have a beginning and an end, so the wise do not delight in them.",
    "5.23": "Those persons are yogis, who before giving up the body are able to check the forces of desire and anger; and they alone are happy.",
    "5.24": "Those who are happy within themselves, enjoying the delight of God within, and are illumined by the inner light, such yogis are united with the Lord and are liberated from material existence.",
    "5.25": "Those holy persons, whose sins have been purged, whose doubts are annihilated, whose minds are disciplined, and who are devoted to the welfare of all beings, attain God and are liberated from material existence.",
    "5.26": "For those sanyāsīs, who have broken out of anger and lust through constant effort, who have subdued their mind, and are self-realized, liberation from material existence is both here and hereafter.",
    "5.27 - 5.28": "Shutting out all thoughts of external enjoyment, with the gaze fixed on the space between the eye-brows, equalizing the flow of the incoming and outgoing breath in the nostrils, and thus controlling the senses, mind, and intellect, the sage who becomes free from desire and fear, always lives in freedom.",
    "5.29": "Having realized Me as the enjoyer of all sacrifices and austerities, the Supreme Lord of all the worlds and the selfless friend of all living beings, My devotee attains peace.",
    "15.1": "The Supreme Divine Personality said: They speak of an eternal aśhvatth tree with its roots above and branches below. Its leaves are the Vedic hymns, and one who knows the secret of this tree is the knower of the Vedas.",
    "15.2": "The branches of the tree extend upward and downward, nourished by the three guṇas, with the objects of the senses as tender buds. The roots of the tree hang downward, causing the flow of karma in the human form. Below, its roots branch out causing (karmic) actions in the world of humans.",
    "15.3 - 15.4": "The real form of this tree is not perceived in this world, neither its beginning nor end, nor its continued existence. But this deep-rooted aśhvatth tree must be cut down with a strong axe of detachment. Then one must search out the base of the tree, which is the Supreme Lord, from whom streamed forth the activity of the universe a long time ago. Upon taking refuge in Him, one will not return to this world again.",
    "15.5": "Those who are free from vanity and delusion, who have overcome the evil of attachment, who dwell constantly on the self and on God, who are free from the desire to enjoy the senses, and are beyond the dualities of pleasure and pain, such liberated personalities attain My eternal Abode.",
    "15.6": "Neither the sun nor the moon, nor fire can illumine that Supreme Abode of Mine. Having gone There, one does not return to this material world again.",
    "15.7": "The embodied souls in this material world are My eternal fragmental parts. But bound by material nature, they are struggling with the six senses including the mind.",
    "15.8": "As the air carries fragrance from place to place, so does the embodied soul carry the mind and senses with it, when it leaves an old body and enters a new one.",
    "15.9": "Using the sense perceptions of the ears, eyes, skin, tongue, and nose, which are grouped around the mind, the embodied soul savors the objects of the senses.",
    "15.10": "The ignorant do not perceive the soul as it resides in the body, and as it enjoys sense objects; nor do they perceive it when it departs. But those who possess the eyes of knowledge can behold it.",
    "15.11": "Striving yogis too are able to realize the soul enshrined in the body. However, those whose minds are not purified cannot cognize it, even though they strive to do so.",
    "15.12": "Know that I am like the brilliance of the sun that illuminates the entire solar system. The radiance of the moon and the brightness of the fire also come from Me.",
    "15.13": "Permeating the earth, I nourish all living beings with My energy. Becoming the moon, I nourish all plants with the juice of life.",
    "15.14": "It is I who take the form of the fire of digestion in the stomachs of all living beings, and combine with the incoming and outgoing breaths, to digest and assimilate the four kinds of foods.",
    "15.15": "I am seated in the hearts of all living beings, and from Me come memory, knowledge, as well as forgetfulness. I alone am to be known by all the Vedas, am the author of the Vedant, and the knower of the meaning of the Vedas.",
    "15.16": "There are two kinds of beings in creation, the kṣhar (perishable) and the akṣhar (imperishable). The perishable are all beings in the material realm. The imperishable are the the liberated beings.",
    "15.17": "Besides these, is the Supreme Divine Personality, who is the indestructible Supreme Soul. He enters the three worlds as the unchanging Controller and supports all living beings.",
    "15.18": "I am transcendental to the perishable world of matter, and even to the imperishable soul; hence I am celebrated, both in the Vedas and the Smṛitis, as the Supreme Divine Personality.",
    "15.19": "Those who know Me without doubt as the Supreme Divine Personality truly have complete knowledge. O Arjun, they worship Me with their whole being.",
    "15.20": "I have shared this most secret principle of the Vedic scriptures with you, O sinless Arjun. By understanding this, a person becomes enlightened, and fulfills all that is to be accomplished.",
    "9.1": "The Supreme Lord said: O Arjun, because you are not envious of Me, I shall now impart to you this very confidential knowledge and wisdom, upon knowing which you will be released from the miseries of material existence.",
    "9.2": "This knowledge is the king of sciences and the most profound of all secrets. It purifies those who hear it. It is directly realizable, in accordance with dharma, easy to practice, and everlasting in effect.",
    "9.3": "People who have no faith in this dharma are unable to attain Me, O conqueror of enemies. They repeatedly come back to this world in the cycle of birth and death.",
    "9.4": "This entire cosmic manifestation is pervaded by Me in My unmanifest form. All living beings dwell in Me, but I do not dwell in them.",
    "9.5": "And yet, the living beings do not abide in Me. Behold the mystery of My divine energy! Although I am the Creator and Sustainer of all living beings, I am not influenced by them or by material nature.",
    "9.6": "Know that as the mighty wind blowing everywhere rests always in the sky, likewise all living beings always rest in Me.",
    "9.7 - 9.8": "At the end of one kalp, all living beings merge into My primordial material energy. At the beginning of the next creation, O son of Kunti, I manifest them again. Presiding over My material energy, I generate these myriad forms again and again, in accordance with the force of their natures.",
    "9.9": "O conqueror of wealth, none of these actions bind Me. I remain like a neutral observer, ever detached from these actions.",
    "9.10": "Working under My direction, this material energy brings into being all animate and inanimate forms, O son of Kunti. For this reason, the material world undergoes the changes (of creation, maintenance, and dissolution).",
    "9.11": "When I descend in My personal form deluded persons are unable to recognize Me. They do not know the divinity of My personality, as the Supreme Lord of all beings.",
    "9.12": "Bewildered by the material energy, such persons embrace demoniac and atheistic views. In that deluded state, their hopes for welfare are in vain, their fruitive actions are wasted, and their culture of knowledge is baffled.",
    "9.13": "But the great souls, who take shelter of My divine energy, O Parth, know Me, Lord Krishna, as the origin of all creation. They engage in My devotion with their minds fixed exclusively on Me.",
    "9.14": "Always singing My divine glories, striving with great determination, and humbly bowing down before Me, they constantly worship Me in loving devotion.",
    "9.15": "Others, engaging in the yajña of cultivating knowledge, worship Me by many methods. Some see Me as undifferentiated oneness that is non-different from them, while others see Me as separate from them. Still others worship Me in the infinite manifestations of My cosmic form.",
    "9.16 - 9.17": "It is I who am the Vedic ritual, I am the sacrifice, and I am the oblation offered to the ancestors. I am the medicinal herb, and I am the Vedic mantra. I am the clarified butter, I am the fire and the act of offering. Of this universe, I am the Father; I am also the Mother, the Sustainer, and the Grandsire. I am the purifier, the goal of knowledge, the sacred syllable Om. I am the Ṛig Veda, Sāma Veda, and the Yajur Veda.",
    "9.18": "I am the Supreme Goal of all living beings, and I am also their Sustainer, Master, Witness, Abode, Shelter, and Friend. I am the Origin, End, and Resting Place of creation; I am the Repository and Eternal Seed.",
    "9.19": "I radiate heat as the sun, and I withhold, as well as send forth rain. I am immortality as well as death personified, O Arjun. I am the spirit as well as matter.",
    "9.20": "Those who are inclined to the fruitive activity described in the Vedas worship Me through ritualistic sacrifices. Being purified from sin by drinking the Soma juice, which is the remnant of the yajñas, they seek to go to heaven. By virtue of their pious deeds, they go to the abode of Indra, the king of heaven, and enjoy the pleasures of the celestial gods.",
    "9.21": "When they have enjoyed the vast pleasures of heaven, the stock of their merits being exhausted, they return to the earthly plane. Thus, those who follow the Vedic rituals, desiring objects of enjoyment, repeatedly come and go in this world.",
    "9.22": "There are those who always think of Me and engage in exclusive devotion to Me. To them, whose minds are always absorbed in Me, I provide what they lack and preserve what they already possess.",
    "9.23": "O son of Kunti, even those devotees who faithfully worship other gods also worship Me. But they do so by the wrong method.",
    "9.24": "I am the enjoyer and the only Lord of all sacrifices. But those who fail to realize My divine nature must be reborn.",
    "9.25": "Worshippers of the celestial gods take birth amongst the celestial gods, worshippers of the ancestors go to the ancestors, worshippers of ghosts take birth amongst such beings, and My devotees come to Me alone.",
    "9.26": "If one offers to Me with devotion a leaf, a flower, a fruit, or even water, I delightfully partake of that item offered with love by My devotee in pure consciousness.",
    "9.27": "Whatever you do, whatever you eat, whatever you offer as oblation to the sacred fire, whatever you bestow as a gift, and whatever austerities you perform, O son of Kunti, do them as an offering to Me.",
    "9.28": "By dedicating all your works to Me, you will be freed from the bondage of good and bad results. With your mind attached to Me through renunciation, you will be liberated and will reach Me.",
    "9.29": "I am equally disposed to all living beings; I am neither inimical nor partial to anyone. But the devotees who worship Me with love reside in Me and I reside in them.",
    "9.30": "Even if the vilest sinners worship Me with exclusive devotion, they are to be considered righteous because they have made the proper resolve.",
    "9.31": "Quickly they become virtuous, and attain lasting peace. O son of Kunti, declare it boldly that no devotee of Mine is ever lost.",
    "9.32": "All those who take refuge in Me, whatever their birth, race, gender, or caste, even those whom society scorns, will attain the supreme destination.",
    "9.33": "What then to speak about kings and sages with meritorious deeds? Therefore, having come to this transient and joyless world, engage in devotion unto Me.",
    "9.34": "Always think of Me, be devoted to Me, worship Me, and offer obeisance to Me. Having dedicated your mind and body to Me, you will certainly come to Me.",
    "2.1": "Sanjay said: Seeing Arjun overwhelmed with pity, his mind grief-stricken, and his eyes full of tears, Shree Krishna spoke the following words.",
    "2.2": "The Supreme Lord said: My dear Arjun, how has this delusion overcome you in this hour of peril? It is not befitting an honorable person. It leads not to the higher abodes, but to disgrace.",
    "2.3": "O Parth, it does not befit you to yield to this unmanliness. Give up such petty weakness of heart and arise, O vanquisher of enemies.",
    "2.4": "Arjun said: O Madhusudan, how can I shoot arrows in battle on men like Bheeshma and Dronacharya, who are worthy of my worship, O destroyer of enemies?",
    "2.5": "It would be better to live in this world by begging, than to enjoy life by killing these noble elders, who are my teachers. If we kill them, the wealth and pleasures we enjoy will be tainted with blood.",
    "2.6": "We do not even know which result of this war is preferable for us—conquering them or being conquered by them. Even after killing them we will not desire to live. Yet they have taken the side of the sons of Dhritarasthra, and now stand before us on the battlefield.",
    "2.7": "I am confused about my duty, and am besieged with anxiety and faintheartedness. I am Your disciple, and am surrendered to You. Please instruct me for certain what is best for me.",
    "2.8": "I can find no means of driving away this anguish that is drying up my senses. Even if I win a prosperous and unrivalled kingdom on the earth, or gain sovereignty like the celestial gods, I will be unable to dispel this grief.",
    "2.9": "Sanjay said: Having thus spoken, Gudakesh, that chastiser of enemies, addressed Hrishikesh: “Govind, I shall not fight,” and became silent.",
    "2.10": "O Dhritarashtra, thereafter, in the midst of both the armies, Shree Krishna smilingly spoke the following words to the grief-stricken Arjun.",
    "2.11": "The Supreme Lord said: While you speak words of wisdom, you are mourning for that which is not worthy of grief. The wise lament neither for the living nor for the dead.",
    "2.12": "Never was there a time when I did not exist, nor you, nor all these kings; nor in the future shall any of us cease to be.",
    "2.13": "Just as the embodied soul continuously passes from childhood to youth to old age, similarly, at the time of death, the soul passes into another body. The wise are not deluded by this.",
    "2.14": "O son of Kunti, the contact between the senses and the sense objects gives rise to fleeting perceptions of happiness and distress. These are non-permanent, and come and go like the winter and summer seasons. O descendent of Bharat, one must learn to tolerate them without being disturbed.",
    "2.15": "O Arjun, noblest amongst men, that person who is not affected by happiness and distress, and remains steady in both, becomes eligible for liberation.",
    "2.16": "Of the transient there is no endurance, and of the eternal there is no cessation. This has verily been observed and concluded by the seers of the Truth, after studying the nature of both.",
    "2.17": "That which pervades the entire body, know it to be indestructible. No one can cause the destruction of the imperishable soul.",
    "2.18": "Only the material body is perishable; the embodied soul within is indestructible, immeasurable, and eternal. Therefore, fight, O descendent of Bharat.",
    "2.19": "Neither of them is in knowledge—the one who thinks the soul can slay and the one who thinks the soul can be slain. For truly, the soul neither kills nor can it be killed.",
    "2.20": "The soul is neither born, nor does it ever die; nor having once existed, does it ever cease to be. The soul is without birth, eternal, immortal, and ageless. It is not destroyed when the body is destroyed.",
    "2.21": "O Parth, how can one who knows the soul to be imperishable, eternal, unborn, and immutable kill anyone or cause anyone to kill?",
    "2.22": "As a person sheds worn-out garments and wears new ones, likewise, at the time of death, the soul casts off its worn-out body and enters a new one.",
    "2.23": "Weapons cannot shred the soul, nor can fire burn it. Water cannot wet it, nor can the wind dry it.",
    "2.24": "The soul is unbreakable and incombustible; it can neither be dampened nor dried. It is everlasting, in all places, unalterable, immutable, and primordial.",
    "2.25": "The soul is spoken of as invisible, inconceivable, and unchangeable. Knowing this, you should not grieve for the body.",
    "2.26": "If, however, you think that the self is subject to constant birth and death, O mighty-armed Arjun, even then you should not grieve like this.",
    "2.27": "Death is certain for one who has been born, and rebirth is inevitable for one who has died. Therefore, you should not lament over the inevitable.",
    "2.28": "O scion of Bharat, all created beings are unmanifest before birth, manifest in life, and again unmanifest on death. So why grieve?O scion of Bharat, all created beings are unmanifest before birth, manifest in life, and again unmanifest on death. So why grieve?",
    "2.29": "Some see the soul as amazing, some describe it as amazing, and some hear of the soul as amazing, while others, even on hearing, cannot understand it at all.",
    "2.30": "O Arjun, the soul that dwells within the body is immortal; therefore, you should not mourn for anyone.",
    "2.31": "Besides, considering your duty as a warrior, you should not waver. Indeed, for a warrior, there is no better engagement than fighting for upholding of righteousness.",
    "2.32": "O Parth, happy are the warriors to whom such opportunities to defend righteousness come unsought, opening for them the stairway to the celestial abodes.",
    "2.33": "If, however, you refuse to fight this righteous war, abandoning your social duty and reputation, you will certainly incur sin.",
    "2.34": "People will speak of you as a coward and a deserter. For a respectable person, infamy is worse than death.",
    "2.35": "The great generals who hold you in high esteem will think that you fled from the battlefield out of fear, and thus will lose their respect for you.",
    "2.36": "Your enemies will defame and humiliate you with unkind words, disparaging your might. Alas, what could be more painful than that?",
    "2.37": "If you fight, you will either be slain on the battlefield and go to the celestial abodes, or you will gain victory and enjoy the kingdom on earth. Therefore arise with determination, O son of Kunti, and be prepared to fight.",
    "2.38": "Fight for the sake of duty, treating alike happiness and distress, loss and gain, victory and defeat. Fulfilling your responsibility in this way, you will never incur sin.",
    "2.39": "Hitherto, I have explained to you Sānkhya Yog, or analytic knowledge regarding the nature of the soul. Now listen, O Parth, as I reveal Buddhi Yog, or the Yog of Intellect. When you work with such understanding, you will be freed from the bondage of karma.",
    "2.40": "Working in this state of consciousness, there is no loss or adverse result, and even a little effort saves one from great danger.",
    "2.41": "O descendent of the Kurus, the intellect of those who are on this path is resolute, and their aim is one-pointed. But the intellect of those who are irresolute is many-branched.",
    "2.42 - 2.43": "Those with limited understanding, get attracted to the flowery words of the Vedas, which advocate ostentatious rituals for elevation to the celestial abodes, and presume no higher principle is described in them. They glorify only those portions of the Vedas that please their senses, and perform pompous ritualistic ceremonies for attaining high birth, opulence, sensual enjoyment, and elevation to the heavenly planets.",
    "2.44": "With their minds deeply attached to worldly pleasures and their intellects bewildered by such things, they are unable to possess the resolute determination for success on the path to God.",
    "2.45": "The Vedas deal with the three modes of material nature, O Arjun. Rise above the three modes to a state of pure spiritual consciousness. Freeing yourself from dualities, eternally fixed in Truth, and without concern for material gain and safety, be situated in the self.",
    "2.46": "Whatever purpose is served by a small well of water is naturally served in all respects by a large lake. Similarly, one who realizes the Absolute Truth also fulfills the purpose of all the Vedas.",
    "2.47": "You have a right to perform your prescribed duties, but you are not entitled to the fruits of your actions. Never consider yourself to be the cause of the results of your activities, nor be attached to inaction.",
    "2.48": "Be steadfast in the performance of your duty, O Arjun, abandoning attachment to success and failure. Such equanimity is called Yog.",
    "2.49": "Seek refuge in divine knowledge and insight, O Arjun, and discard reward-seeking actions that are certainly inferior to works performed with the intellect established in divine knowledge. Miserly are those who seek to enjoy the fruits of their works.",
    "2.50": "One who prudently practices the science of work without attachment can get rid of both good and bad reactions in this life itself. Therefore, strive for Yog, which is the art of working skillfully (in proper consciousness).",
    "2.51": "The wise endowed with equanimity of intellect, abandon attachment to the fruits of actions, which bind one to the cycle of life and death. By working in such consciousness, they attain the state beyond all suffering.",
    "2.52": "When your intellect crosses the quagmire of delusion, you will then acquire indifference to what has been heard and what is yet to be heard (about enjoyments in this world and the next).",
    "2.53": "When your intellect ceases to be allured by the fruitive sections of the Vedas and remains steadfast in divine consciousness, you will then attain the state of perfect Yog.",
    "2.54": "Arjun said : O Keshav, what is the disposition of one who is situated in divine consciousness? How does an enlightened person talk? How does he sit? How does he walk?",
    "2.55": "The Supreme Lord said: O Parth, when one discards all selfish desires and cravings of the senses that torment the mind, and becomes satisfied in the realization of the self, such a person is said to be transcendentally situated.",
    "2.56": "One whose mind remains undisturbed amidst misery, who does not crave for pleasure, and who is free from attachment, fear, and anger, is called a sage of steady wisdom.",
    "2.57": "One who remains unattached under all conditions, and is neither delighted by good fortune nor dejected by tribulation, he is a sage with perfect knowledge.",
    "2.58": "One who is able to withdraw the senses from their objects, just as a tortoise withdraws its limbs into its shell, is established in divine wisdom.",
    "2.59": "Aspirants may restrain the senses from their objects of enjoyment, but the taste for the sense objects remains. However, even this taste ceases for those who realizes the Supreme.",
    "2.60": "The senses are so strong and turbulent, O son of Kunti, that they can forcibly carry away the mind even of a person endowed with discrimination who practices self-control.",
    "2.61": "They are established in perfect knowledge, who subdue their senses and keep their minds ever absorbed in Me.",
    "2.62": "While contemplating on the objects of the senses, one develops attachment to them. Attachment leads to desire, and from desire arises anger.",
    "2.63": "Anger leads to clouding of judgment, which results in bewilderment of memory. When memory is bewildered, the intellect gets destroyed; and when the intellect is destroyed, one is ruined.",
    "2.64": "But one who controls the mind, and is free from attachment and aversion, even while using the objects of the senses, attains the Grace of God.",
    "2.65": "By divine grace comes the peace in which all sorrows end, and the intellect of such a person of tranquil mind soon becomes firmly established in God.",
    "2.66": "But an undisciplined person, who has not controlled the mind and senses, can neither have a resolute intellect nor steady contemplation on God. For one who never unites the mind with God there is no peace; and how can one who lacks peace be happy?",
    "2.67": "Just as a strong wind sweeps a boat off its chartered course on the water, even one of the senses on which the mind focuses can lead the intellect astray.",
    "2.68": "Therefore, one who has restrained the senses from their objects, O mighty armed Arjun, is firmly established in transcendental knowledge.",
    "2.69": "What all beings consider as day is the night of ignorance for the wise, and what all creatures see as night is the day for the introspective sage.",
    "2.70": "Just as the ocean remains undisturbed by the incessant flow of waters from rivers merging into it, likewise the sage who is unmoved despite the flow of desirable objects all around him attains peace, and not the person who strives to satisfy desires.",
    "2.71": "That person, who gives up all material desires and lives free from a sense of greed, proprietorship, and egoism, attains perfect peace.",
    "2.72": "O Parth, such is the state of an enlightened soul that having attained it, one is never again deluded. Being established in this consciousness even at the hour of death, one is liberated from the cycle of life and death and reaches the Supreme Abode of God.",
    "12.1": "Arjun inquired: Between those who are steadfastly devoted to Your personal form and those who worship the formless Brahman, whom do You consider to be more perfect in Yog?",
    "12.2": "The Lord said: Those who fix their minds on Me and always engage in My devotion with steadfast faith, I consider them to be the best yogis.",
    "12.3 - 12.4": "But those who worship the formless aspect of the Absolute Truth—the imperishable, the indefinable, the unmanifest, the all-pervading, the unthinkable, the unchanging, the eternal, and the immoveable—by restraining their senses and being even-minded everywhere, such persons, engaged in the welfare of all beings, also attain Me.",
    "12.5": "For those whose minds are attached to the unmanifest, the path of realization is full of tribulations. Worship of the unmanifest is exceedingly difficult for embodied beings.",
    "12.6 - 12.7": "But those who dedicate all their actions to Me, regarding Me as the Supreme goal, worshiping Me and meditating on Me with exclusive devotion, O Parth, I swiftly deliver them from the ocean of birth and death, for their consciousness is united with Me.",
    "12.8": "Fix your mind on Me alone and surrender your intellect to Me. There upon, you will always live in Me. Of this, there is no doubt.",
    "12.9": "If you are unable to fix your mind steadily on Me, O Arjun, then practice remembering Me with devotion while constantly restraining the mind from worldly affairs.",
    "12.10": "If you cannot practice remembering Me with devotion, then just try to work for Me. Thus performing devotional service to Me, you shall achieve the stage of perfection.",
    "12.11": "If you are unable to even work for Me in devotion, then try to renounce the fruits of your actions and be situated in the self.",
    "12.12": "Better than mechanical practice is knowledge; better than knowledge is meditation. Better than meditation is renunciation of the fruits of actions, for peace immediately follows such renunciation.",
    "12.13 - 12.14": "Those devotees are very dear to Me who are free from malice toward all living beings, who are friendly, and compassionate. They are free from attachment to possessions and egotism, equipoised in happiness and distress, and ever-forgiving. They are ever-content, steadily united with Me in devotion, self-controlled, of firm resolve, and dedicated to Me in mind and intellect.",
    "12.15": "Those who are not a source of annoyance to anyone and who in turn are not agitated by anyone, who are equal in pleasure and pain, and free from fear and anxiety, such devotees of Mine are very dear to Me.",
    "12.16": "Those who are indifferent to worldly gains, externally and internally pure, skillful, without cares, untroubled, and free from selfishness in all undertakings, such devotees of Mine are very dear to Me.",
    "12.17": "Those who neither rejoice in mundane pleasures nor despair in worldly sorrows, who neither lament for any loss nor hanker for any gain, who renounce both good and evil deeds, such persons who are full of devotion are very dear to Me.",
    "12.18 - 12.19": "Those, who are alike to friend and foe, equipoised in honor and dishonor, cold and heat, joy and sorrow, and are free from all unfavorable association; those who take praise and reproach alike, who are given to silent contemplation, content with what comes their way, without attachment to the place of residence, whose intellect is firmly fixed in Me, and who are full of devotion to Me, such persons are very dear to Me.",
    "12.20": "Those who honor this nectar of wisdom declared here, have faith in Me, and are devoted and intent on Me as the supreme goal, they are exceedingly dear to Me.",
    "13.1": "Arjun said, “O Keshav, I wish to understand what are prakṛiti and puruṣh, and what are kṣhetra and kṣhetrajña? I also wish to know what is true knowledge, and what is the goal of this knowledge?",
    "13.2": "The Supreme Divine Lord said: O Arjun, this body is termed as kṣhetra (the field of activities), and the one who knows this body is called kṣhetrajña (the knower of the field) by the sages who discern the truth about both.",
    "13.3": "O scion of Bharat, I am also the knower of all the individual fields of activity. The understanding of the body as the field of activities, and the soul and God as the knowers of the field, this I hold to be true knowledge.",
    "13.4": "Listen and I will explain to you what that field is and what its nature is. I will also explain how change takes place within it, from what it was created, who the knower of the field of activities is, and what his powers are.",
    "13.5": "Great sages have sung the truth about the field and the knower of the field in manifold ways. It has been stated in various Vedic hymns, and especially revealed in the Brahma Sūtra, with sound logic and conclusive evidence.",
    "13.6": "The field of activities is composed of the five great elements, the ego, the intellect, the unmanifest primordial matter, the eleven senses (five knowledge senses, five working senses, and mind), and the five objects of the senses.",
    "13.7": "Desire and aversion, happiness and misery, the body, consciousness, and the will—all these comprise the field and its modifications.",
    "13.8 - 13.12": "Humbleness; freedom from hypocrisy; non-violence; forgiveness; simplicity; service of the Guru; cleanliness of body and mind; steadfastness; and self-control; dispassion toward the objects of the senses; absence of egotism; keeping in mind the evils of birth, disease, old age, and death; non-attachment; absence of clinging to spouse, children, home, and so on; even-mindedness amidst desired and undesired events in life; constant and exclusive devotion toward Me; an inclination for solitary places and an aversion for mundane society; constancy in spiritual knowledge; and philosophical pursuit of the Absolute Truth—all these I declare to be knowledge, and what is contrary to it, I call ignorance.",
    "13.13": "I shall now reveal to you that which ought to be known, and by knowing which, one attains immortality. It is the beginningless Brahman, which lies beyond existence and non-existence.",
    "13.14": "Everywhere are His hands and feet, eyes, heads, and faces. His ears too are in all places, for He pervades everything in the universe.",
    "13.15": "Though He perceives all sense-objects, yet He is devoid of the senses. He is unattached to everything, and yet He is the sustainer of all. Although He is without attributes, yet He is the enjoyer of the three modes of material nature.",
    "13.16": "He exists outside and inside all living beings, those that are moving and not moving. He is subtle, and hence, He is incomprehensible. He is very far, but He is also very near.",
    "13.17": "He is indivisible, yet He appears to be divided amongst living beings. Know the Supreme Entity to be the Sustainer, Annihilator, and Creator of all beings.",
    "13.18": "He is the source of light in all luminaries, and is entirely beyond the darkness of ignorance. He is knowledge, the object of knowledge, and the goal of knowledge. He dwells within the hearts of all living beings.",
    "13.19": "I have thus revealed to you the nature of the field, the meaning of knowledge, and the object of knowledge. Only My devotees can understand this in reality, and by doing so, they attain My divine nature.",
    "13.20": "Know that prakṛiti (material nature) and puruṣh (the individual souls) are both beginningless. Also know that all transformations of the body and the three modes of nature are produced by material energy.",
    "13.21": "In the matter of creation, the material energy is responsible for cause and effect; in the matter of experiencing happiness and distress, the individual soul is declared responsible.",
    "13.22": "When the puruṣh (individual soul) seated in prakṛiti (the material energy) desires to enjoy the three guṇas, attachment to them becomes the cause of its birth in superior and inferior wombs.",
    "13.23": "Within the body also resides the Supreme Lord. He is said to be the Witness, the Permitter, the Supporter, Transcendental Enjoyer, the ultimate Controller, and the Paramātmā (Supreme Soul).",
    "13.24": "Those who understand the truth about Supreme Soul, the individual soul, material nature, and the interaction of the three modes of nature will not take birth here again. They will be liberated regardless of their present condition.",
    "13.25": "Some try to perceive the Supreme Soul within their hearts through meditation, and others try to do so through the cultivation of knowledge, while still others strive to attain that realization by the path of action.",
    "13.26": "There are still others who are unaware of these spiritual paths, but they hear from others and begin worshipping the Supreme Lord. By such devotion to hearing from saints, they too can gradually cross over the ocean of birth and death.",
    "13.27": "O best of the Bharatas, whatever moving or unmoving being you see in existence, know it to be a combination of the field of activities and the knower of the field.",
    "13.28": "They alone truly see, who perceive the Paramātmā (Supreme Soul) accompanying the soul in all beings, and who understand both to be imperishable in this perishable body.",
    "13.29": "Those, who see God as the Supreme Soul equally present everywhere and in all living beings, do not degrade themselves by their mind. Thereby, they reach the supreme destination.",
    "13.30": "They alone truly see who understand that all actions (of the body) are performed by material nature, while the embodied soul actually does nothing.",
    "13.31": "When they see the diverse variety of living beings situated in the same material nature, and understand all of them to be born from it, they attain the realization of the Brahman.",
    "13.32": "The Supreme Soul is imperishable, without beginning, and devoid of any material qualities, O son of Kunti. Although situated within the body, It neither acts, nor is It tainted by material energy.",
    "13.33": "Space holds everything within it, but being subtle, does not get contaminated by what it holds. Similarly, though its consciousness pervades the body, the soul is not affected by the attributes of the body.",
    "13.34": "Just as one sun illumines the entire solar system, so does the individual soul illumine the entire body (with consciousness).",
    "13.35": "Those who perceive with the eyes of knowledge the difference between the body and the knower of the body, and the process of release from material nature, attain the supreme destination.",
    "3.1 - 3.2": "Arjun said: O Janardan, if You consider knowledge superior to action, then why do You ask me to wage this terrible war? My intellect is bewildered by Your ambiguous advice. Please tell me decisively the one path by which I may attain the highest good.",
    "3.3": "The Lord said: O sinless one, the two paths leading to enlightenment were previously explained by Me: the path of knowledge, for those inclined toward contemplation, and the path of work for those inclined toward action.",
    "3.4": "One cannot achieve freedom from karmic reactions by merely abstaining from work, nor can one attain perfection of knowledge by mere physical renunciation.",
    "3.5": "There is no one who can remain without action even for a moment. Indeed, all beings are compelled to act by their qualities born of material nature (the three guṇas).",
    "3.6": "Those who restrain the external organs of action, while continuing to dwell on sense objects in the mind, certainly delude themselves and are to be called hypocrites.",
    "3.7": "But those karm yogis who control their knowledge senses with the mind, O Arjun, and engage the working senses in working without attachment, are certainly superior.",
    "3.8": "You should thus perform your prescribed Vedic duties, since action is superior to inaction. By ceasing activity, even your bodily maintenance will not be possible.",
    "3.9": "Work must be done as a yajna to the Supreme Lord; otherwise, work causes bondage in this material world. Therefore, O son of Kunti, for the satisfaction of God, perform your prescribed duties, without being attached to the results.",
    "3.10": "In the beginning of creation, Brahma created humankind along with duties, and said, 'Prosper in the performance of these yajñas (sacrifices), for they shall bestow upon you all you wish to achieve.'",
    "3.11": "By your sacrifices, the celestial gods will be pleased, and by cooperation between humans and the celestial gods, great prosperity will reign for all.",
    "3.12": "The celestial gods, being satisfied by the performance of sacrifice, will grant you all the desired necessities of life. But those who enjoy what is given to them, without making offerings in return, are verily thieves.",
    "3.13": "The spiritually-minded, who eat food that is first offered in sacrifice, are released from all kinds of sin. Others, who cook food for their own enjoyment, verily eat only sin.",
    "3.14": "All living beings subsist on food, and food is produced by rains. Rains come from the performance of sacrifice, and sacrifice is produced by the performance of prescribed duties.",
    "3.15": "The duties for human beings are described in the Vedas, and the Vedas are manifested by God Himself. Therefore, the all-pervading Lord is eternally present in acts of sacrifice.",
    "3.16": "O Parth, those who do not accept their responsibility in the cycle of sacrifice established by the Vedas are sinful. They live only for the delight of their senses; indeed their lives are in vain.",
    "3.17": "But those who rejoice in the self, who are illumined and fully satisfied in the self, for them, there is no duty",
    "3.18": "Such self-realized souls have nothing to gain or lose either in discharging or renouncing their duties. Nor do they need to depend on other living beings to fulfill their self-interest.",
    "3.19": "Therefore, giving up attachment, perform actions as a matter of duty because by working without being attached to the fruits, one attains the Supreme.",
    "3.20 - 3.21": "By performing their prescribed duties, King Janak and others attained perfection. You should also perform your duties to set an example for the good of the world. Whatever actions great persons perform, common people follow. Whatever standards they set, all the world pursues",
    "3.22": "There is no duty for Me to do in all the three worlds, O Parth, nor do I have anything to gain or attain. Yet, I am engaged in prescribed duties.",
    "3.23": "For if I did not carefully perform the prescribed duties, O Parth, all men would follow My path in all respects.",
    "3.24": "If I ceased to perform prescribed actions, all these worlds would perish. I would be responsible for the pandemonium that would prevail, and would thereby destroy the peace of the human race.",
    "3.25": "As ignorant people perform their duties with attachment to the results, O scion of Bharat, so should the wise act without attachment, for the sake of leading people on the right path.",
    "3.26": "The wise should not create discord in the intellects of ignorant people, who are attached to fruitive actions, by inducing them to stop work. Rather, by performing their duties in an enlightened manner, they should inspire the ignorant also to do their prescribed duties.",
    "3.27": "All activities are carried out by the three modes of material nature. But in ignorance, the soul, deluded by false identification with the body, thinks of itself as the doer.",
    "3.28": "O mighty-armed Arjun, illumined persons distinguish the soul as distinct from guṇas and karmas. They perceive that it is only the guṇas (in the shape of the senses, mind, and others) that move among the guṇas (in the shape of the objects of perception), and thus they do not get entangled in them.",
    "3.29": "Those who are deluded by the operation of the guṇas become attached to the results of their actions. But the wise who understand these truths should not unsettle such ignorant people who know very little.",
    "3.30": "Performing all works as an offering unto Me, constantly meditate on Me as the Supreme. Become free from desire and selfishness, and with your mental grief departed, fight!",
    "3.31": "Those who abide by these teachings of Mine, with profound faith and free from envy, are released from the bondage of karma.",
    "3.32": "But those who find faults with My teachings, being bereft of knowledge and devoid of discrimination, they disregard these principles and bring about their own ruin.",
    "3.33": "Even wise people act according to their natures, for all living beings are propelled by their natural tendencies. What will one gain by repression?",
    "3.34": "The senses naturally experience attachment and aversion to the sense objects, but do not be controlled by them, for they are way-layers and foes.",
    "3.35": "It is far better to perform one’s natural prescribed duty, though tinged with faults, than to perform another’s prescribed duty, though perfectly. In fact, it is preferable to die in the discharge of one’s duty, than to follow the path of another, which is fraught with danger.",
    "3.36": "Arjun asked: Why is a person impelled to commit sinful acts, even unwillingly, as if by force, O descendent of Vrishni (Krishna)?",
    "3.37": "The Supreme Lord said: It is lust alone, which is born of contact with the mode of passion, and later transformed into anger. Know this as the sinful, all-devouring enemy in the world.",
    "3.38": "Just as a fire is covered by smoke, a mirror is masked by dust, and an embryo is concealed by the womb, similarly one’s knowledge gets shrouded by desire.",
    "3.39": "The knowledge of even the most discerning gets covered by this perpetual enemy in the form of insatiable desire, which is never satisfied and burns like fire, O son of Kunti.",
    "3.40": "The senses, mind, and intellect are said to be breeding grounds of desire. Through them, it clouds one’s knowledge and deludes the embodied soul.",
    "3.41": "Therefore, O best of the Bharatas, in the very beginning bring the senses under control and slay this enemy called desire, which is the embodiment of sin and destroys knowledge and realization.",
    "3.42": "The senses are superior to the gross body, and superior to the senses is the mind. Beyond the mind is the intellect, and even beyond the intellect is the soul.",
    "3.43": "Thus knowing the soul to be superior to the material intellect, O mighty armed Arjun, subdue the lower self (senses, mind, and intellect) by the higher self (strength of the soul), and kill this formidable enemy called lust.",
    "10.1": "The Lord said: Listen again to My divine teachings, O mighty armed one. Desiring your welfare because you are My beloved friend, I shall reveal them to you.",
    "10.2": "Neither celestial gods nor the great sages know of My origin. I am the source from which the gods and great seers come.",
    "10.3": "Those who know Me as unborn and beginningless, and as the Supreme Lord of the universe, they among mortals are free from illusion and released from all evils.",
    "10.4 - 10.5": "From Me alone arise the varieties of qualities in humans, such as intellect, knowledge, clarity of thought, forgiveness, truthfulness, control over the senses and mind, joy and sorrow, birth and death, fear and courage, non-violence, equanimity, contentment, austerity, charity, fame, and infamy.",
    "10.6": "The seven great Sages, the four great Saints before them, and the fourteen Manus, are all born from My mind. From them, all the people in the world have descended.",
    "10.7": "Those who know in truth My glories and divine powers become united with Me through unwavering Bhakti Yog. Of this there is no doubt.",
    "10.8": "I am the origin of all creation. Everything proceeds from Me. The wise who know this perfectly worship Me with great faith and devotion.",
    "10.9": "With their minds fixed on Me and their lives surrendered to Me, My devotees remain ever content in Me. They derive great satisfaction and bliss in enlightening one another about Me and in conversing about My glories.",
    "10.10": "To those whose minds are always united with Me in loving devotion, I give the divine knowledge by which they can attain Me.",
    "10.11": "Out of compassion for them, I, who dwell within their hearts, destroy the darkness born of ignorance, with the luminous lamp of knowledge.",
    "10.12 - 10.13": "Arjun said: You are the Supreme Divine Personality, the Supreme Abode, the Supreme Purifier, the Eternal God, the Primal Being, the Unborn, and the Greatest. The great sages, like Narad, Asit, Deval, and Vyas, proclaimed this, and now You are declaring it to me Yourself.",
    "10.14": "O Krishna, I totally accept everything You have told me as the Truth. O Lord, neither gods nor the demons can understand Your true personality.",
    "10.15": "Indeed, You alone know Yourself by Your inconceivable energy, O Supreme Personality, the Creator and Lord of all beings, the God of gods, and the Lord of the universe!",
    "10.16 - 10.17": "Please describe to me Your divine opulences, by which You pervade all the worlds and reside in them. O Supreme Master of Yog, how may I know You and think of You. And while meditating, in what forms can I think of You, O Supreme Divine Personality?",
    "10.18": "Tell me again in detail Your divine glories and manifestations, O Janardan. I can never tire of hearing your nectar.",
    "10.19": "The Lord spoke: I shall now briefly describe My divine glories to you, O best of the Kurus, for there is no end to their detail.",
    "10.20": "O Arjun, I am seated in the heart of all living entities. I am the beginning, middle, and end of all beings.",
    "10.21": "Amongst the twelve sons of Aditi I am Vishnu; amongst luminous objects I am the sun. Know Me to be Marichi amongst the maruts, and the moon amongst the stars in the night sky.",
    "10.22": "I am the Samaveda amongst the Vedas, and Indra amongst the celestial gods. Amongst the senses I am the mind; amongst the living beings I am consciousness.",
    "10.23": "Amongst the rudras know Me to be Shankar; amongst the semi-celestial beings and demons I am Kuber. I am Agni amongst the vasus and Meru amongst the mountains.",
    "10.24": "O Arjun, amongst priests, I am Brihaspati; amongst warrior chiefs I am Kartikeya; and amongst reservoirs of water, know Me to be the ocean.",
    "10.25": "I am Bhrigu amongst the great seers and the transcendental Om amongst sounds. Amongst chants know Me to be the repetition of the Holy Name; amongst immovable things I am the Himalayas.",
    "10.26": "Amongst trees I am the peepal tree (sacred fig tree); of the celestial sages I am Narad. Amongst the gandharvas I am Chitrath, and amongst the siddhas I am sage Kapil.",
    "10.27": "Amongst horses know Me to be Ucchaihshrava, begotten from the churning of the ocean of nectar. I am Airavata amongst all lordly elephants, and the king amongst humans.",
    "10.28": "I am the Vajra (thunderbolt) amongst weapons and Kamadhenu amongst the cows. I am Kaamdev, the god of love, amongst all causes for procreation; and amongst serpents, I am Vasuki.",
    "10.29": "Amongst the snakes I am Anant; amongst aquatics I am Varun. Amongst the departed ancestors I am Aryama; amongst dispensers of law I am Yamraj, the lord of death.",
    "10.30": "I am Prahlad amongst the demons; amongst all that controls I am time. Know me to be the lion amongst animals, and Garud amongst the birds.",
    "10.31": "Amongst purifiers, I am the wind, and amongst wielders of weapons, I am Lord Ram. Of water creatures, I am the crocodile, and of flowing rivers, I am the Ganges.",
    "10.32": "O Arjun, know Me to be the beginning, middle, and end of all creation. Amongst sciences I am the science of spirituality, and in debates I am the logical conclusion.",
    "10.33": "I am the beginning “A” amongst all letters; I am the dual word in grammatical compounds. I am the endless Time, and amongst creators I am Brahma.",
    "10.34": "I am the all-devouring death, and I am the origin of those things that are yet to be. Amongst feminine qualities I am fame, prosperity, fine speech, memory, intelligence, courage, and forgiveness.",
    "10.35": "Amongst the hymns in the Samaveda know me to be the Brihatsama; amongst poetic meters I am the Gayatri. Of the twelve months of the Hindu calendar I am Margsheersh, and of seasons I am spring, which brings forth flowers.",
    "10.36": "I am the gambling of the cheats and the splendor of the splendid. I am the victory of the victorious, the resolve of the resolute, and the virtue of the virtuous.",
    "10.37": "Amongst the descendants of Vrishni, I am Krishna, and amongst the Pandavas I am Arjun. Know me to be Ved Vyas amongst the sages, and Shukracharya amongst the great thinkers.",
    "10.38": "I am just punishment amongst means of preventing lawlessness, and proper conduct amongst those who seek victory. Amongst secrets I am silence, and in the wise I am their wisdom.",
    "10.39": "I am the generating seed of all living beings, O Arjun. No creature moving or non-moving can exist without Me.",
    "10.40": "There is no end to My divine manifestations, O conqueror of enemies. What I have declared to you is a mere sample of My infinite glories.",
    "10.41": "Whatever you see as beautiful, glorious, or powerful, know it to spring from but a spark of My splendor.",
    "10.42": "What need is there for all this detailed knowledge, O Arjun? Simply know that by one fraction of My being, I pervade and support this entire creation.",
    "11.1": "Arjun said: Having heard the supremely confidential spiritual knowledge, which You have revealed out of compassion for me, my illusion is now dispelled.",
    "11.2": "I have heard from You in detail about the appearance and disappearance of all living beings, O Lotus-eyed One, and also about Your eternal magnificence.",
    "11.3": "O Supreme Lord, You are precisely what You declare yourself to be. Now I desire to see Your divine cosmic form, O Greatest of persons.",
    "11.4": "O Lord of all mystic powers, if You think I am strong enough to behold It, then kindly reveal that imperishable cosmic form to me.",
    "11.5": "The Supreme Lord said: Behold, O Parth, My hundreds and thousands of wonderful forms of various shapes, sizes, and colors.",
    "11.6": "Behold in Me, O scion of the Bharatas, the (twelve) sons of Aditi, the (eight) vasus, the (eleven) rudras, the (twin) Ashwini Kumars, as well as the (forty-nine) maruts and many more marvels never revealed before.",
    "11.7": "Behold now, Arjun, the entire universe, with everything moving and non-moving, assembled together in My universal form. Whatever else you wish to see, observe it all within this universal form.",
    "11.8": "But you cannot see My cosmic form with these physical eyes of yours. Therefore, I grant you divine vision. Behold My majestic opulence!",
    "11.9": "Sanjay said: O King, having spoken thus, the Supreme Lord of Yog, Shree Krishna, displayed his divine and opulent form to Arjun.",
    "11.10 - 11.11": "In that cosmic form, Arjun saw unlimited faces and eyes, decorated with many celestial ornaments and wielding many kinds of divine weapons. He wore many garlands on His body and was anointed with many sweet-smelling heavenly fragrances. He revealed Himself as the wonderful and infinite Lord whose face is everywhere.",
    "11.12": "If a thousand suns were to blaze forth together in the sky, they would not match the splendor of that great form.",
    "11.13": "There Arjun could see the totality of the entire universe established in one place, in that body of the God of gods.",
    "11.14": "Then, Arjun, full of wonder and with hair standing on end, bowed his head before the Lord and addressed Him, with folded hands.",
    "11.15": "Arjun said: O Shree Krishna, I behold within Your body all the gods and hosts of different beings. I see Brahma seated on the lotus flower; I see Shiv, all the sages, and the celestial serpents.",
    "11.16": "I see Your infinite form in every direction, with countless arms, stomachs, faces, and eyes. O Lord of the universe, whose form is the universe itself, I do not see in You any beginning, middle, or end.",
    "11.17": "I see Your form, adorned with a crown, and armed with the club and disc, shining everywhere as the abode of splendor. It is hard to look upon You in the blazing fire of Your effulgence, which is radiating like the sun in all directions.",
    "11.18": "I recognize You as the supreme imperishable being, the Ultimate Truth to be known by the scriptures. You are the support of all creation; You are the eternal protector of Sanātan Dharma (the Eternal Religion); and You are the everlasting Supreme Divine Personality.",
    "11.19": "You are without beginning, middle, or end; Your power has no limits. Your arms are infinite; the sun and the moon are like Your eyes, and fire is like Your mouth. I see you warming the entire creation by Your radiance.",
    "11.20": "The space between heaven and earth and all the directions is pervaded by You alone. Seeing Your wondrous and terrible form, I see the three worlds trembling in fear, O Greatest of all beings.",
    "11.21": "All the celestial gods are taking Your shelter by entering into You. In awe, some are praising You with folded hands. The great sages and perfected beings are extolling You with auspicious hymns and profuse prayers.",
    "11.22": "The rudras, adityas, vasus, sadhyas, vishvadevas, Ashwini Kumars, maruts, ancestors, gandharvas, yakshas, asuras, and siddhas are all beholding You in wonder.",
    "11.23": "O mighty Lord, in veneration of Your magnificent form with its many mouths, eyes, arms, thighs, legs, stomachs, and terrifying teeth, all the worlds are terror-stricken, and so am I.",
    "11.24": "O Lord Vishnu, seeing Your form touching the sky, effulgent in many colors, with mouths wide open and enormous blazing eyes, my heart is trembling with fear. I have lost all courage and peace of mind.",
    "11.25": "Having seen Your many mouths bearing Your terrible teeth, resembling the raging fire at the time of annihilation, I forget where I am and do not know where to go. O Lord of lords, You are the shelter of the universe; please have mercy on me.",
    "11.26 - 11.27": "I see all the sons of Dhritarashtra, along with their allied kings, including Bheeshma, Dronacharya, Karn, and also the generals from our side, rushing headlong into Your fearsome mouths. I see some with their heads smashed between Your terrible teeth.",
    "11.28 - 11.29": "As many waves of the rivers flowing rapidly into the ocean, so are all these great warriors entering into Your blazing mouths. As moths rush with great speed into the fire to perish, so are all these armies entering with great speed into Your mouths.",
    "11.30": "With Your fiery tongues You are licking up the hosts of living beings on all sides and devouring them with Your blazing mouths. O Vishnu, You are scorching the entire universe with the fierce, all-pervading rays of Your effulgence.",
    "11.31": "Tell me who You are, so fierce of form. O God of gods, I bow before You; please bestow Your mercy on me. You, who existed before all creation, I wish to know who You are, for I do not comprehend Your nature and workings.",
    "11.32": "The Supreme Lord said: I am mighty Time, the source of destruction that comes forth to annihilate the worlds. Even without your participation, the warriors arrayed in the opposing army shall cease to exist.",
    "11.33": "Therefore, arise and attain honor! Conquer your foes and enjoy prosperous rulership. These warriors stand already slain by Me, and you will only be an instrument of My work, O expert archer.",
    "11.34": "Dronacharya, Bheeshma, Jayadratha, Karn, and other brave warriors have already been killed by Me. Therefore, slay them without being disturbed. Just fight and you will be victorious over your enemies in battle.",
    "11.35": "Sanjay said: Hearing these words of Keshav, Arjun trembled with dread. With palms joined, he bowed before Shree Krishna and spoke in a faltering voice, overwhelmed with fear.",
    "11.36": "Arjun said: O Master of the senses, it is but apt that the universe rejoices in giving You praise and is enamored by You. Demons flee fearfully from You in all directions and hosts of perfected saints bow to You.",
    "11.37": "O Great One, who are even greater than Brahma, the original creator, why should they not bow to you? O Limitless One, O Lord of the devatās, O Refuge of the universe, You are the imperishable reality beyond both the manifest and the non-manifest.",
    "11.38": "You are the primeval God and the original Divine Personality; You are the sole resting place of this universe. You are both the knower and the object of knowledge; You are the Supreme Abode. O possessor of infinite forms, You alone pervade the entire universe.",
    "11.39": "You are Vāyu (god of wind), Yamraj (god of death), Agni (god of fire), Varuṇ (god of water), and Chandra (moon-god). You are the creator Brahma, and the Great-grandfather of all beings. I offer my salutations unto You a thousand times, again and yet again!",
    "11.40": "O Lord of infinite power, my salutations to You from the front and the rear, indeed from all sides! You possess infinite valor and might and pervade everything, and thus, You are everything.",
    "11.41 - 11.42": "Thinking of You as my friend, I presumptuously addressed You as, “O Krishna,” “O Yadav,” “O my dear Friend.” I was ignorant of Your majesty, showing negligence and undue affection. And if, jestfully, I treated You with disrespect, while playing, resting, sitting, eating, when alone, or before others—for all that I crave forgiveness.",
    "11.43": "You are the Father of the entire universe, of all moving and non-moving beings. You are the most deserving of worship and the Supreme Spiritual Master. When there is none equal to You in all the three worlds, then who can possibly be greater than You, O Possessor of incomparable power?",
    "11.44": "Therefore, O adorable Lord, bowing deeply and prostrating before You, I implore You for Your grace. As a father tolerates his son, a friend forgives his friend, and a lover pardons the beloved, please forgive me for my offences.",
    "11.45": "Having seen Your universal form that I had never seen before, I feel great joy. And yet, my mind trembles with fear. Please have mercy on me and again show me Your pleasing form, O God of gods, O Abode of the universe.",
    "11.46": "O Thousand-armed One, though You are the embodiment of all creation, I wish to see You in Your four-armed form, carrying the mace and disc, and wearing the crown.",
    "11.47": "The Lord said: Arjun, being pleased with you, by My Yogmaya power, I gave you a vision of My resplendent, unlimited, and primeval cosmic form. No one before you has ever seen it.",
    "11.48": "Not by study of the Vedas, nor by the performance of sacrifice, rituals, or charity, nor even by practicing severe austerities, has any mortal ever seen what you have seen, O best of the Kuru warriors.",
    "11.49": "Be neither afraid nor bewildered on seeing this terrible form of Mine. Be free from fear and with a cheerful heart, behold Me once again in My personal form",
    "11.50": "Sanjay said: Having spoken thus, the compassionate son of Vasudev displayed His personal (four-armed) form again. Then, He further consoled the frightened Arjun by assuming His gentle (two-armed) form.",
    "11.51": "Arjun said: O Shree Krishna, seeing Your gentle human form (two-armed), I have regained my composure and my mind is restored to normal.",
    "11.52 - 11.53": "The Supreme Lord said: This form of Mine that you are seeing is exceedingly difficult to behold. Even the celestial gods are eager to see it. Neither by the study of the Vedas, nor by penance, charity, or fire sacrifices, can I be seen as you have seen Me.",
    "11.54": "O Arjun, by unalloyed devotion alone can I be known as I am, standing before you. Thereby, on receiving My divine vision, O scorcher of foes, one can enter into union with Me.",
    "11.55": "Those who perform all their duties for My sake, who depend upon Me and are devoted to Me, who are free from attachment, and are without malice toward all beings, such devotees certainly come to Me.",
    "1.1": "Dhritarashtra said: O Sanjay, after gathering on the holy field of Kurukshetra, and desiring to fight, what did my sons and the sons of Pandu do?",
    "1.2": "Sanjay said: On observing the Pandava army standing in military formation, King Duryodhan approached his teacher Dronacharya, and said the following words.",
    "1.3": "Duryodhan said: Respected teacher! Behold the mighty army of the sons of Pandu, so expertly arrayed for battle by your own gifted disciple, the son of Drupad.",
    "1.4 - 1.6": "Behold in their ranks are many powerful warriors, like Yuyudhan, Virat, and Drupad, wielding mighty bows and equal in military prowess to Bheem and Arjun. There are also accomplished heroes like Dhrishtaketu, Chekitan, the gallant King of Kashi, Purujit, Kuntibhoj, and Shaibya—all the best of men. In their ranks, they also have the courageous Yudhamanyu, the gallant Uttamauja, the son of Subhadra, and the sons of Draupadi, who are all great warrior chiefs.",
    "1.7": "O best of Brahmins, hear too about the principal generals on our side, who are especially qualified to lead. These I now recount unto you.",
    "1.8": "There are personalities like yourself, Bheeshma, Karna, Kripa, Ashwatthama, Vikarn, and Bhurishrava, who are ever victorious in battle.",
    "1.9": "Also, there are many other heroic warriors, who are prepared to lay down their lives for my sake. They are all skilled in the art of warfare, and equipped with various kinds of weapons.",
    "1.10": "The strength of our army is unlimited and we are safely marshalled by Grandsire Bheeshma, while the strength of the Pandava army, carefully marshalled by Bheem, is limited.",
    "1.11": "Therefore, I call upon all the generals of the Kaurava army now to give full support to Grandsire Bheeshma, even as you defend your respective strategic points.",
    "1.12": "Then, the grand old man of the Kuru dynasty, the glorious patriarch Bheeshma, roared like a lion, and blew his conch shell very loudly, giving joy to Duryodhan.",
    "1.13": "Thereafter, conches, kettledrums, bugles, trumpets, and horns suddenly blared forth, and their combined sound was overwhelming.",
    "1.14": "Then, from amidst the Pandava army, seated in a glorious chariot drawn by white horses, Madhav and Arjun blew their Divine conch shells.",
    "1.15": "Hrishikesh blew his conch shell, called Panchajanya, and Arjun blew the Devadutta. Bheem, the voracious eater and performer of herculean tasks, blew his mighty conch, called Paundra.",
    "1.16 - 1.18": "King Yudhishthir, blew the Anantavijay, while Nakul and Sahadev blew the Sughosh and Manipushpak. The excellent archer and king of Kashi, the great warrior Shikhandi, Dhrishtadyumna, Virat, and the invincible Satyaki, Drupad, the five sons of Draupadi, and the mighty-armed Abhimanyu, son of Subhadra, all blew their respective conch shells, O Ruler of the earth.",
    "1.19": "The terrific sound thundered across the sky and the earth, and shattered the hearts of your sons, O Dhritarasthra.",
    "1.20": "At that time, the son of Pandu, Arjun, who had the insignia of Hanuman on the flag of his chariot, took up his bow. Seeing your sons arrayed against him, O King, Arjun then spoke the following words to Shree Krishna.",
    "1.21 - 1.22": "Arjun said: O Infallible One, please take my chariot to the middle of both armies, so that I may look at the warriors arrayed for battle, whom I must fight in this great combat.",
    "1.23": "I desire to see those who have come here to fight on the side of the evil-minded son of Dhritarasthra, wishing to please him.",
    "1.24": "Sanjay said: O Dhritarasthra, having thus been addressed by Arjun, the conqueror of sleep, Shree Krishna then drew the magnificent chariot between the two armies.",
    "1.25": "In the presence of Bheeshma, Dronacharya, and all the other kings, Shree Krishna said: O Parth, behold these Kurus gathered here.",
    "1.26": "There, Arjun could see stationed in both armies, his fathers, grandfathers, teachers, maternal uncles, brothers, cousins, sons, nephews, grand-nephews, friends, fathers-in-law, and well-wishers.",
    "1.27": "Seeing all his relatives present there, Arjun, the son of Kunti, was overwhelmed with compassion, and with deep sorrow, spoke the following words.",
    "1.28": "Arjun said: O Krishna, seeing my own kinsmen arrayed for battle here and intent on killing each other, my limbs are giving way and my mouth is drying up.",
    "1.29 - 1.31": "My whole body shudders; my hair is standing on end. My bow, the Gāṇḍīv, is slipping from my hand, and my skin is burning all over. My mind is in quandary and whirling in confusion; I am unable to hold myself steady any longer. O Krishna, killer of the Keshi demon, I only see omens of misfortune. I do not foresee how any good can come from killing my own kinsmen in this battle.",
    "1.32 - 1.33": "O Krishna, I do not desire victory, kingdom, or the happiness accruing to it. Of what avail will be a kingdom, pleasures, or even life itself, when the very persons for whom we covet them, are standing before us for battle?",
    "1.34 - 1.35": "Teachers, fathers, sons, grandfathers, maternal uncles, grandsons, fathers-in-law, grand-nephews, brothers-in-law, and other kinsmen are present here, staking their lives and riches. O Madhusudan, I do not wish to slay them, even if they attack me. If we kill the sons of Dhritarashtra, what satisfaction will we derive from the dominion over the three worlds, what to speak of this Earth?",
    "1.36 - 1.37": "O Maintainer of all living entities, what pleasure will we derive from killing the sons of Dhritarasthra? Even though they may be aggressors, sin will certainly come upon us if we slay them. Hence, it does not behoove us to kill our own cousins, the sons of Dhritarashtra, and friends. O Madhav (Krishna), how can we hope to be happy by killing our own kinsmen?",
    "1.38 - 1.39": "Their thoughts are overpowered by greed and they see no wrong in annihilating their relatives or wreaking treachery upon friends. Yet, O Janardan (Krishna), why should we, who can clearly see the crime in killing our kindred, not turn away from this sin?",
    "1.40": "When a dynasty is destroyed, its traditions get vanquished, and the rest of the family becomes involved in irreligion.",
    "1.41": "With the preponderance of vice, O Krishna, the women of the family become immoral; and from the immorality of women, O descendent of Vrishni, unwanted progeny are born.",
    "1.42": "An increase in unwanted children results in hellish life both for the family and for those who destroy the family. Deprived of sacrificial offerings, the ancestors of such corrupt families also fall.",
    "1.43": "Through the evil deeds of those who destroy the family tradition and thus give rise to unwanted progeny, a variety of social and family welfare activities are ruined.",
    "1.44": "O Janardan (Krishna), I have heard from the learned that those who destroy family traditions dwell in hell for an indefinite period of time.",
    "1.45 - 1.46": "Alas! How strange it is that we have set our mind to perform this great sin with horrifying consequences. Driven by the desire for kingly pleasures, we are intent on killing our own kinsmen. It would be better if, with weapons in hand, the sons of Dhritarashtra kill me unarmed and unresisting on the battlefield.",
    "1.47": "Sanjay said: Speaking thus, Arjun cast aside his bow and arrows, and sank into the seat of his chariot, his mind in distress and overwhelmed with grief.",
    "16.1 - 16.3": "The Supreme Divine Personality said: O scion of Bharat, these are the saintly virtues of those endowed with a divine nature—fearlessness, purity of mind, steadfastness in spiritual knowledge, charity, control of the senses, sacrifice, study of the sacred books, austerity, and straightforwardness; non-violence, truthfulness, absence of anger, renunciation, peacefulness, restraint from fault-finding, compassion toward all living beings, absence of covetousness, gentleness, modesty, and lack of fickleness; vigor, forgiveness, fortitude, cleanliness, bearing enmity toward none, and absence of vanity.",
    "16.4": "O Parth, the qualities of those who possess a demoniac nature are hypocrisy, arrogance, conceit, anger, harshness, and ignorance.",
    "16.5": "The divine qualities lead to liberation, while the demoniac qualities are the cause for a continuing destiny of bondage. Grieve not, O Arjun, as you were born with saintly virtues.",
    "16.6": "There are two kinds of beings in this world—those endowed with a divine nature and those possessing a demoniac nature. I have described the divine qualities in detail, O Arjun. Now hear from me about the demoniac nature.",
    "16.7": "Those possessing a demoniac nature do not comprehend which actions are proper and which are improper. Hence, they possess neither purity, nor good conduct, nor even truthfulness.",
    "16.8": "They say, 'The world is without Absolute Truth, without any basis (for moral order), and without a God (who has created or is controlling it). It is created from the combination of the two sexes, and has no purpose other than sexual gratification.'",
    "16.9": "Holding fast to such views, these misdirected souls, with small intellect and cruel actions, arise as enemies of the world threatening its destruction.",
    "16.10": "Harboring insatiable lust, full of hypocrisy, pride and arrogance, the demoniac cling to their false tenets. Thus illusioned, they are attracted to the impermanent and work with impure resolve.",
    "16.11": "They are obsessed with endless anxieties that end only with death. Still, they maintain with complete assurance that gratification of desires and accumulation of wealth is the highest purpose of life.",
    "16.12": "Held in bondage by hundreds of desires, and driven by lust and anger, they strive to accumulate wealth by unjust means, all for the gratification of their senses.",
    "16.13 - 16.15": "The demoniac persons think, “I have gained so much wealth today, and I shall now fulfill this desire of mine. This is mine, and tomorrow I shall have even more. That enemy has been destroyed by me, and I shall destroy the others too! I am like God Himself, I am the enjoyer, I am perfect, I am powerful, and I am happy. I am wealthy and I have highly placed relatives. Who else is equal to me? I shall perform sacrifices (to the celestial gods); I shall give alms; I shall rejoice.” In this way, they are deluded by ignorance.",
    "16.16": "Possessed and led astray by such imaginings, enveloped in a mesh of delusion, and addicted to the gratification of sensuous pleasures, they descend to the murkiest hell.",
    "16.17": "Such self-conceited and stubborn people, full of pride and arrogant in their wealth, perform ostentatious sacrifices in name only, with no regard to the rules of the scriptures.",
    "16.18": "Blinded by egotism, strength, arrogance, desire, and anger, the demonic abuse Me, who am present in their own body and in the bodies of others.",
    "16.19 - 16.20": "These cruel and hateful persons, the vile and vicious of humankind, I constantly hurl into the wombs of those with similar demoniac natures in the cycle of rebirth in the material world. These ignorant souls take birth again and again in demoniac wombs. Failing to reach Me, O Arjun, they gradually sink to the most abominable type of existence.",
    "16.21": "There are three gates leading to the hell of self-destruction for the soul—lust, anger, and greed. Therefore, one should abandon all three.",
    "16.22": "Those who are free from the three gates to darkness endeavor for the welfare of their soul, and thereby attain the supreme goal.",
    "16.23": "Those who act under the impulse of desire, discarding the injunctions of the scriptures, attain neither perfection, nor happiness, nor the supreme goal in life.",
    "16.24": "Therefore, let the scriptures be your authority in determining what should be done and what should not be done. Understand the scriptural injunctions and teachings, and then perform your actions in this world accordingly.",
    "6.1": "The Supreme Lord said: Those who perform prescribed duties without desiring the results of their actions are actual sanyāsīs (renunciates) and yogis, not those who have merely ceased performing sacrifices such as Agnihotra yajna or abandoned bodily activities",
    "6.2": "What is known as sanyās is non-different from Yog, for none become yogis without renouncing worldly desires.",
    "6.3": "To the soul who is aspiring for perfection in Yog, work without attachment is said to be the means; to the sage who is already elevated in Yog, tranquility in meditation is said to be the means.",
    "6.4": "When one is neither attached to sense objects nor to actions, such a person is said to be elevated in the science of Yog, having renounced all desires for the fruits of actions.",
    "6.5": "Elevate yourself through the power of your mind, and not degrade yourself, for the mind can be the friend and also the enemy of the self.",
    "6.6": "For those who have conquered the mind, it is their friend. For those who have failed to do so, the mind works like an enemy.",
    "6.7": "The yogis who have conquered the mind rise above the dualities of cold and heat, joy and sorrow, and honor and dishonor. Such yogis remain peaceful and steadfast in their devotion to God.",
    "6.8": "The yogi who are satisfied by knowledge and discrimination, and have conquered their senses, remain undisturbed in all circumstances. They see everything—dirt, stones, and gold—as the same.",
    "6.9": "The yogis look upon all—well-wishers, friends, foes, the pious, and the sinners—with an impartial intellect. The yogi who is of equal intellect toward friend, companion, and foe, neutral among enemies and relatives, and unbiased between the righteous and sinful, is considered to be distinguished among humans.",
    "6.10": "Those who seek the state of Yog should reside in seclusion, constantly engaged in meditation with a controlled mind and body, getting rid of desires and possessions for enjoyment.",
    "6.11": "To practice Yog, one should make an āsan (seat) in a sanctified place, by placing Kuśh grass, deer skin, and a cloth, one over the other. The āsan should be neither too high nor too low.",
    "6.12 - 6.13": "Seated firmly on it, the yogi should strive to purify the mind by focusing it in meditation with one pointed concentration, controlling all thoughts and activities. He must hold the body, neck, and head firmly in a straight line, and gaze at the tip of the nose, without allowing the eyes to wander.",
    "6.14": "Thus, with a serene, fearless, and unwavering mind, and staunch in the vow of celibacy, the vigilant yogi should meditate on Me, having Me alone as the supreme goal.",
    "6.15": "Thus, constantly keeping the mind absorbed in Me, the yogi of disciplined mind attains nirvāṇ, and abides in Me in supreme peace.",
    "6.16": "O Arjun, those who eat too much or too little, sleep too much or too little, cannot attain success in Yog.",
    "6.17": "But those who are temperate in eating and recreation, balanced in work, and regulated in sleep, can mitigate all sorrows by practicing Yog.",
    "6.18": "With thorough discipline, they learn to withdraw the mind from selfish cravings and rivet it on the unsurpassable good of the self. Such persons are said to be in Yog, and are free from all yearning of the senses.",
    "6.19": "Just as a lamp in a windless place does not flicker, so the disciplined mind of a yogi remains steady in meditation on the Supreme.",
    "6.20": "When the mind, restrained from material activities, becomes still by the practice of Yog, then the yogi is able to behold the soul through the purified mind, and he rejoices in the inner joy.",
    "6.21": "In that joyous state of Yog, called samadhi, one experiences supreme boundless divine bliss, and thus situated, one never deviates from the Eternal Truth.",
    "6.22": "Having gained that state, one does not consider any attainment to be greater. Being thus established, one is not shaken even in the midst of the greatest calamity.",
    "6.23": "That state of severance from union with misery is known as Yog. This Yog should be resolutely practiced with determination free from pessimism.",
    "6.24 - 6.25": "Completely renouncing all desires arising from thoughts of the world, one should restrain the senses from all sides with the mind. Slowly and steadily, with conviction in the intellect, the mind will become fixed in God alone, and will think of nothing else.",
    "6.26": "Whenever and wherever the restless and unsteady mind wanders, one should bring it back and continually focus it on God.",
    "6.27": "Great transcendental happiness comes to the yogi whose mind is calm, whose passions are subdued, who is without sin, and who sees everything in connection with God.",
    "6.28": "The self-controlled yogi, thus uniting the self with God, becomes free from material contamination, and being in constant touch with the Supreme, achieves the highest state of perfect happiness.",
    "6.29": "The true yogis, uniting their consciousness with God, see with equal eye, all living beings in God and God in all living beings.",
    "6.30": "For those who see Me everywhere and see all things in Me, I am never lost, nor are they ever lost to Me.",
    "6.31": "The yogi who is established in union with Me, and worships Me as the Supreme Soul residing in all beings, dwells only in Me, though engaged in all kinds of activities.",
    "6.32": "I regard them to be perfect yogis who see the true equality of all living beings and respond to the joys and sorrows of others as if they were their own.",
    "6.33": "Arjun said: The system of Yog that you have described, O Madhusudan, appears impractical and unattainable to me, due to the restless mind.",
    "6.34": "The mind is very restless, turbulent, strong and obstinate, O Krishna. It appears to me that it is more difficult to control than the wind.",
    "6.35": "Lord Krishna said: O mighty-armed son of Kunti, what you say is correct; the mind is indeed very difficult to restrain. But by practice and detachment, it can be controlled.",
    "6.36": "Yog is difficult to attain for one whose mind is unbridled. However, those who have learnt to control the mind, and who strive earnestly by proper means, can attain perfection in Yog. This is My opinion.",
    "6.37": "Arjun said: What is the fate of the unsuccessful yogi who begins the path with faith, but who does not endeavor sufficiently due to an unsteady mind and is unable to reach the goal of Yog in this life?",
    "6.38": "Does not such a person who deviates from Yog get deprived of both material and spiritual success, O mighty-armed Krishna, and perish like a broken cloud with no position in either sphere?",
    "6.39": "O Krishna, please dispel this doubt of mine completely, for who other than You can do so?",
    "6.40": "The Supreme Lord said: O Parth, one who engages on the spiritual path does not meet with destruction either in this world or the world to come. My dear friend, one who strives for God-realization is never overcome by evil.",
    "6.41 - 6.42": "The unsuccessful yogis, upon death, go to the abodes of the virtuous. After dwelling there for many ages, they are again reborn in the earth plane, into a family of pious and prosperous people. Else, if they had developed dispassion due to long practice of Yog, they are born into a family endowed with divine wisdom. Such a birth is very difficult to attain in this world.",
    "6.43": "On taking such a birth, O descendant of Kurus, they reawaken the wisdom of their previous lives, and strive even harder toward perfection in Yog.",
    "6.44": "Indeed, they feel drawn toward God, even against their will, on the strength of their past discipline. Such seekers naturally rise above the ritualistic principles of the scriptures",
    "6.45": "With the accumulated merits of many past births, when these yogis engage in sincere endeavors to make further progress, they become purified from material desires and attain perfection in this life itself.",
    "6.46": "A yogi is superior to the tapasvī (ascetic), superior to the jñānī (a person of learning), and even superior to the karmī (ritualistic performer). Therefore, O Arjun, strive to be a yogi.",
    "6.47": "Of all yogis, those whose minds are always absorbed in Me, and who engage in devotion to Me with great faith, them I consider to be the highest of all.",
    "7.1": "The Supreme Lord said: Now listen, O Arjun, how, with the mind attached exclusively to Me, and surrendering to Me through the practice of bhakti yog, you can know Me completely, free from doubt.",
    "7.2": "I shall now reveal unto you fully this knowledge and wisdom, knowing which nothing else remains to be known in this world.",
    "7.3": "Amongst thousands of persons, hardly one strives for perfection; and amongst those who have achieved perfection, hardly one knows Me in truth.",
    "7.4": "Earth, water, fire, air, space, mind, intellect, and ego—these are eight components of My material energy.",
    "7.5": "Such is My inferior energy. But beyond it, O mighty-armed Arjun, I have a superior energy. This is the jīva śhakti (the soul energy), which comprises the embodied souls who are the basis of life in this world.",
    "7.6": "Know that all living beings are manifested by these two energies of Mine. I am the source of the entire creation, and into Me it again dissolves.",
    "7.7": "There is nothing higher than Myself, O Arjun. Everything rests in Me, as beads strung on a thread.",
    "7.8": "I am the taste in water, O son of Kunti, and the radiance of the sun and the moon. I am the sacred syllable Om in the Vedic mantras; I am the sound in ether, and the ability in humans",
    "7.9": "I am the pure fragrance of the Earth, and the brilliance in fire. I am the life-force in all beings, and the penance of the ascetics.",
    "7.10": "O Arjun, know that I am the eternal seed of all beings. I am the intellect of the intelligent, and the splendor of the glorious.",
    "7.11": "O best of the Bharatas, in strong persons, I am their strength devoid of desire and passion. I am sexual activity not conflicting with virtue or scriptural injunctions.",
    "7.12": "The three states of material existence—goodness, passion, and ignorance—are manifested by My energy. They are in Me, but I am beyond them.",
    "7.13": "Deluded by the three modes of Maya, people in this world are unable to know Me, the imperishable and eternal.",
    "7.14": "My divine energy Maya, consisting of the three modes of nature, is very difficult to overcome. But those who surrender unto Me cross over it easily.",
    "7.15": "Four kinds of people do not surrender unto Me—those ignorant of knowledge, those who lazily follow their lower nature though capable of knowing Me, those with deluded intellect, and those with a demoniac nature.",
    "7.16": "O best amongst the Bharatas, four kinds of pious people engage in My devotion—the distressed, the seekers of knowledge, the seekers of worldly possessions, and those who are situated in knowledge.",
    "7.17": "Amongst these, I consider them to be the highest, who worship Me with knowledge, and are steadfastly and exclusively devoted to Me. I am very dear to them and they are very dear to Me.",
    "7.18": "All those who are devoted to Me are indeed noble. But those in knowledge, who are of steadfast mind, whose intellect is merged in Me, and who have made Me alone as their supreme goal, I consider as My very self.",
    "7.19": "After many births of spiritual practice, one who is endowed with knowledge surrenders unto Me, knowing Me to be all that is. Such a great soul is indeed very rare.",
    "7.20": "Those whose knowledge has been carried away by material desires surrender to the celestial gods. Following their own nature, they worship the devatās, practicing rituals meant to propitiate these celestial personalities.",
    "7.21": "Whatever celestial form a devotee seeks to worship with faith, I steady the faith of such a devotee in that form.",
    "7.22": "Endowed with faith, the devotee worships a particular celestial god and obtains the objects of desire. But in reality, I alone arrange these benefits.",
    "7.23": "But the fruit gained by these people of little understanding is perishable. Those who worship the celestial gods go to the celestial abodes, while My devotees come to Me.",
    "7.24": "The less intelligent think that I, the Supreme Lord Shree Krishna, was formless earlier and have now assumed this personality. They do not understand the imperishable exalted nature of My personal form.",
    "7.25": "I am not manifest to everyone, being veiled by My divine Yogmaya energy. Hence, those without knowledge do not know that I am without birth and changeless.",
    "7.26": "O Arjun, I know of past, present, and future, and I also know all living beings; but Me no one knows.",
    "7.27": "O descendant of Bharat, the dualities of desire and aversion arise from illusion. O conqueror of enemies, all living beings in the material realm are deluded by these.",
    "7.28": "But persons, whose sins have been destroyed by engaging in pious activities, become free from the illusion of dualities. Such persons worship Me with determination.",
    "7.29": "Those who take shelter in Me, striving for liberation from old-age and death, come to know the Brahman, the individual self, and the entire field of karmic action.",
    "7.30": "Those who know Me as the governing principle of the adhibhūta (field of matter) and the adhidaiva (the celestial gods), and as adhiyajña (the Lord of all sacrificial performances), such enlightened souls are in full consciousness of Me even at the time of death.",
    "17.1": "Arjun said: O Krishna, where do they stand who disregard the injunctions of the scriptures, but still worship with faith? Is their faith in the mode of goodness, passion, or ignorance?",
    "17.2": "The Supreme Divine Personality said: Every human being is born with innate faith, which can be of three kinds—sāttvic, rājasic, or tāmasic. Now hear about this from Me.",
    "17.3": "The faith of all humans conforms to the nature of their mind. All people possess faith, and whatever the nature of their faith, that is verily what they are.",
    "17.4": "Those in the mode of goodness worship the celestial gods; those in the mode of passion worship the yakṣhas and rākṣhasas; those in the mode of ignorance worship ghosts and spirits.",
    "17.5 - 17.6": "Some people perform stern austerities that are not enjoined by the scriptures, but rather motivated by hypocrisy and egotism. Impelled by desire and attachment, they torment not only the elements of their body, but also I who dwell within them as the Supreme Soul. Know these senseless people to be of demoniacal resolves.",
    "17.7": "The food that people prefer is according to their dispositions. The same is true for the sacrifice, austerity, and charity they are inclined (or predisposed) toward. Now hear of the distinctions from Me.",
    "17.8": "Persons in the mode of goodness prefer foods that promote life span, and increase virtue, strength, health, happiness, and satisfaction. Such foods are juicy, succulent, nourishing, and naturally tasteful.",
    "17.9": "Foods that are too bitter, too sour, salty, very hot, pungent, dry, and full of chillies, are dear to persons in the mode of passion. Such foods produce pain, grief, and disease.",
    "17.10": "Foods that are overcooked, stale, putrid, polluted, and impure are dear to persons in the mode of ignorance.",
    "17.11": "Sacrifice that is performed according to scriptural injunctions without expectation of rewards, with the firm conviction of the mind that it is a matter of duty, is of the nature of goodness.",
    "17.12": "O best of the Bharatas, know that sacrifice performed for material benefit, or with a hypocritical aim, is in the mode of passion.",
    "17.13": "Sacrifice devoid of faith and contrary to the injunctions of the scriptures, in which no food is offered, no mantras chanted, and no donation made, is to be considered in the mode of ignorance.",
    "17.14": "When worship of the Supreme Lord, the Brahmins, the spiritual master, the wise, and the elders is done with the observance of cleanliness, simplicity, celibacy, and non-violence then this worship is declared as the austerity of the body.",
    "17.15": "Words that do not cause distress, are truthful, inoffensive, and beneficial, as well as regular recitation of the Vedic scriptures—these are declared as austerity of speech.",
    "17.16": "Serenity of thought, gentleness, silence, self-control, and purity of purpose—all these are declared as austerity of the mind.",
    "17.17": "When devout persons with ardent faith practice these three-fold austerities without yearning for material rewards, they are designated as austerities in the mode of goodness.",
    "17.18": "Austerity that is performed with ostentation for the sake of gaining honor, respect, and adoration is in the mode of passion. Its benefits are unstable and transitory.",
    "17.19": "Austerity that is performed by those with confused notions, and which involves torturing the self or harming others, is described to be in the mode of ignorance.",
    "17.20": "Charity given to a worthy person simply because it is right to give, without consideration of anything in return, at the proper time and in the proper place, is stated to be in the mode of goodness.",
    "17.21": "But charity given with reluctance, with the hope of a return or in expectation of a reward, is said to be in the mode of passion.",
    "17.22": "And that charity, which is given at the wrong place and wrong time to unworthy persons, without showing respect, or with contempt, is held to be of the nature of nescience.",
    "17.23": "The words “Om Tat Sat” have been declared as symbolic representations of the Supreme Absolute Truth, from the beginning of creation. From them came the priests, scriptures, and sacrifice.",
    "17.24": "Therefore, when performing acts of sacrifice, offering charity, or undertaking penance, expounders of the Vedas always begin by uttering “Om” according to the prescriptions of Vedic injunctions.",
    "17.25": "Persons who do not desire fruitive rewards, but seek to be free from material entanglements, utter the word “Tat” along with acts of austerity, sacrifice, and charity.",
    "17.26 - 17.27": "The word “Sat” means eternal existence and goodness. O Arjun, it is also used to describe an auspicious action. Being established in the performance of sacrifice, penance, and charity, is also described by the word “Sat.” And so any act for such purposes is named “Sat.”",
    "17.28": "O son of Pritha, whatever acts of sacrifice, charity, or penance are done without faith, are termed as “Asat.” They are useless both in this world and the next."
}