{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"Neo4jGraph.ipynb","version":"0.3.2","provenance":[]},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.7.0"},"kernelspec":{"display_name":"Python 3","language":"python","name":"python3"}},"cells":[{"cell_type":"markdown","metadata":{"id":"xW6JFfar-sfq","colab_type":"text"},"source":["### Generate knowledge graph and support queries using Neo4j\n","##### Dependency - install py2neo\n","##### Prerequisite - Install and have a graph instance running in Neo4j"]},{"cell_type":"markdown","metadata":{"id":"RvWG9Vwo-sfu","colab_type":"text"},"source":["#### Install Py2neo"]},{"cell_type":"code","metadata":{"id":"hilbEVVU-sfw","colab_type":"code","colab":{},"outputId":"efd17804-15e7-4030-b8a8-e88af3a3754a"},"source":["! pip install py2neo"],"execution_count":0,"outputs":[{"output_type":"stream","text":["Requirement already satisfied: py2neo in /Users/priyankha/anaconda3/lib/python3.7/site-packages (4.2.0)\n","Requirement already satisfied: click>=7.0 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from py2neo) (7.0)\n","Requirement already satisfied: pytz in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from py2neo) (2018.5)\n","Requirement already satisfied: colorama in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from py2neo) (0.3.9)\n","Requirement already satisfied: urllib3[secure]<1.25,>=1.23 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from py2neo) (1.23)\n","Requirement already satisfied: neobolt<1.8,>=1.7.3 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from py2neo) (1.7.9)\n","Requirement already satisfied: neotime<1.8,>=1.7.4 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from py2neo) (1.7.4)\n","Requirement already satisfied: pygments<2.4,>=2.3.0 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from py2neo) (2.3.1)\n","Requirement already satisfied: prompt-toolkit<2.1,>=2.0.7 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from py2neo) (2.0.9)\n","Requirement already satisfied: pyOpenSSL>=0.14 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from urllib3[secure]<1.25,>=1.23->py2neo) (18.0.0)\n","Requirement already satisfied: cryptography>=1.3.4 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from urllib3[secure]<1.25,>=1.23->py2neo) (2.3.1)\n","Requirement already satisfied: idna>=2.0.0 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from urllib3[secure]<1.25,>=1.23->py2neo) (2.7)\n","Requirement already satisfied: certifi in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from urllib3[secure]<1.25,>=1.23->py2neo) (2018.8.24)\n","Requirement already satisfied: ipaddress in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from urllib3[secure]<1.25,>=1.23->py2neo) (1.0.22)\n","Requirement already satisfied: six in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from neotime<1.8,>=1.7.4->py2neo) (1.11.0)\n","Requirement already satisfied: wcwidth in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from prompt-toolkit<2.1,>=2.0.7->py2neo) (0.1.7)\n","Requirement already satisfied: asn1crypto>=0.21.0 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from cryptography>=1.3.4->urllib3[secure]<1.25,>=1.23->py2neo) (0.24.0)\n","Requirement already satisfied: cffi!=1.11.3,>=1.7 in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from cryptography>=1.3.4->urllib3[secure]<1.25,>=1.23->py2neo) (1.11.5)\n","Requirement already satisfied: pycparser in /Users/priyankha/anaconda3/lib/python3.7/site-packages (from cffi!=1.11.3,>=1.7->cryptography>=1.3.4->urllib3[secure]<1.25,>=1.23->py2neo) (2.18)\n","\u001b[33mYou are using pip version 18.1, however version 19.1 is available.\n","You should consider upgrading via the 'pip install --upgrade pip' command.\u001b[0m\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"E8Py6Hi2-sgH","colab_type":"code","colab":{}},"source":["from py2neo import Graph\n","from py2neo import Node, Relationship\n","import pickle\n","import pandas as pd"],"execution_count":0,"outputs":[]},{"cell_type":"markdown","metadata":{"id":"3QeOIUzT-sgQ","colab_type":"text"},"source":["### Load Data"]},{"cell_type":"code","metadata":{"id":"zhqFl-c7-sgS","colab_type":"code","colab":{}},"source":["svos = pd.read_csv(\"svos.csv\", names = ['sub', 'rel', 'obj'])\n","pickle_in = open(\"entity_dict.pickle\",\"rb\")\n","entities = pickle.load(pickle_in)"],"execution_count":0,"outputs":[]},{"cell_type":"markdown","metadata":{"id":"W1x26Yuy-sgb","colab_type":"text"},"source":["### Graph construction"]},{"cell_type":"code","metadata":{"id":"adScMnkb-sgc","colab_type":"code","colab":{}},"source":["# Connect to Neo4j using corresponding <port:7687> and <password>\n","graph = Graph(\"bolt://localhost:7687\",password=\"adbi_capstone\")\n","# graph.delete_all()\n","\n","# Parse the entities and build the knowledge graph in Neo4j Database\n","for index, row in svos.iterrows():\n","    sub, rel, obj = row\n","    \n","    sub_node = graph.nodes.match(entities.get(sub, \"Object\"), name=sub).first()\n","    obj_node = graph.nodes.match(\"Object\", name=obj).first()\n","    if not sub_node:\n","        sub_node = Node(entities.get(sub, \"Object\"),name = sub)\n","    if not obj_node:\n","        obj_node = Node(entities.get(obj, \"Object\"),name = obj)\n","    relation = Relationship.type(rel)    \n","    graph.merge(relation(sub_node, obj_node), entities.get(sub, \"Object\"), \"name\" )"],"execution_count":0,"outputs":[]},{"cell_type":"markdown","metadata":{"id":"lSCRo6QN-sgj","colab_type":"text"},"source":["## Query"]},{"cell_type":"code","metadata":{"id":"OJ7dfsPI-sgl","colab_type":"code","colab":{},"outputId":"eefc92bc-c955-4768-86dc-809a04031138"},"source":["# Cypher queries\n","def query_actors_names(graph):\n","    nodes = graph.run(\"MATCH (:Object {name: 'actor'})-[r]-(m)RETURN r, m\")\n","    names = [ node['m']['name'] for node in nodes]\n","    print(names)\n","\n","def query_producers_names(graph):\n","    nodes = graph.run(\"MATCH (:Object {name: 'producer'})-[r]-(m)RETURN r, m\")\n","    names = [ node['m']['name'] for node in nodes]\n","    print(names)\n","\n","\n","def query_all_nodes(graph):\n","    nodes = graph.run(\"MATCH (n)-[r]->(m) RETURN n, r, m\")\n","#     print(nodes.to_table())\n","    return nodes\n","\n","def multi_talented(graph):\n","    nodes = graph.run(\"MATCH (:Object {name: 'actor'})-[r]-(m)RETURN r, m\")\n","    for node in nodes:\n","        rels = graph.run(\"MATCH (:PERSON {name: '%s'})-[r]-(obj)RETURN count(r) as num_rels\" % node['m']['name'])\n","        for rec in rels:\n","            if rels[\"num_rels\"]>1:\n","                print(node['m']['name'])\n","                \n","def describe(graph, actor):\n","    nodes = graph.run(\"MATCH (:PERSON {name: '%s'})-[r]->(m)RETURN r,m\" % actor)\n","    flag=True\n","    for node in nodes:\n","        #print(node['m']['name'])\n","        print(node['r'])\n","        flag = False\n","    if flag:\n","        print(\"{} not found\".format(actor))\n","\n","query_actors_names(graph)\n","nodes = query_all_nodes(graph)\n","\n","for node in nodes:\n","    print(node['r']) "],"execution_count":0,"outputs":[{"output_type":"stream","text":["['Jon Avery Abrahams', 'Zachary Burr Abel', 'Victor Aaron Ramirez', 'Quinton Aaron', 'Kirk M. Acevedo', 'Murray Abraham October', 'Alexander Bud Abbott', 'Christopher Jacob Abbott', 'Adam Keefe Horovitz', 'Jensen Ross Ackles', 'Yousef AbuTaleb', 'Jay Acovone', 'Walter Abel', 'Jacob Allen Abel', 'Bruce Paul Abbott']\n","(Rodolfo Perez Acosta)-[:was {}]->(MexicanAmerican character actor)\n","(Jacob Allen Abel)-[:is {}]->(singer)\n","(Yousef AbuTaleb)-[:is {}]->(producer)\n","(Lee William Aaker)-[:is {}]->(child actor)\n","(Willie Aames)-[:is {}]->(director television producer)\n","(Willie Aames)-[:is {}]->(screenwriter)\n","(Jensen Ross Ackles)-[:is {}]->(director)\n","(which)-[:earned {}]->(Ackles)\n","(Victor Aaron Ramirez)-[:was {}]->(voice)\n","(Jon Avery Abrahams)-[:are {}]->(Bobby)\n","(Cent)-[:is {}]->(television producer entrepreneur)\n","(Cent)-[:is {}]->(investor)\n","(Born)-[:began {}]->(selling)\n","(Costello)-[:were {}]->(comedy duo)\n","(Abbott)-[:were {}]->(comedy duo)\n","(Wee Man)-[:is {}]->(one)\n","(Jason Shannon Acuna)-[:is {}]->(one)\n","(Wee Man)-[:is {}]->(performer)\n","(Jason Shannon Acuna)-[:is {}]->(performer)\n","(Jon Avery Abrahams)-[:is {}]->(actor)\n","(Zachary Burr Abel)-[:is {}]->(actor)\n","(Victor Aaron Ramirez)-[:was {}]->(actor)\n","(Quinton Aaron)-[:is {}]->(actor)\n","(Kirk M. Acevedo)-[:is {}]->(actor)\n","(Murray Abraham October)-[:is {}]->(actor)\n","(Alexander Bud Abbott)-[:was {}]->(actor)\n","(Christopher Jacob Abbott)-[:is {}]->(actor)\n","(Adam Keefe Horovitz)-[:is {}]->(actor)\n","(Jensen Ross Ackles)-[:is {}]->(actor)\n","(Yousef AbuTaleb)-[:is {}]->(actor)\n","(Jay Acovone)-[:is {}]->(actor)\n","(Walter Abel)-[:was {}]->(actor)\n","(Jacob Allen Abel)-[:is {}]->(actor)\n","(Bruce Paul Abbott)-[:is {}]->(actor)\n","(Abbott)-[:gained {}]->(notoriety)\n","(which)-[:earned {}]->(Award nominations)\n","(Adam Keefe Horovitz)-[:is {}]->(rapper guitarist)\n","(Philip Abbott)-[:was {}]->(character actor)\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"_rJJqiFk-sg1","colab_type":"code","colab":{},"outputId":"f98b11f7-2956-4e6a-fb57-d69ee7c8a96c"},"source":["multi_talented(graph)"],"execution_count":0,"outputs":[{"output_type":"stream","text":["Jon Avery Abrahams\n","Victor Aaron Ramirez\n","Adam Keefe Horovitz\n","Jensen Ross Ackles\n","Yousef AbuTaleb\n","Jacob Allen Abel\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"6oYxWNki-sg_","colab_type":"code","colab":{},"outputId":"4e99dd2b-2236-4187-c3e5-08c847b41879"},"source":["query_actors_names(graph)"],"execution_count":0,"outputs":[{"output_type":"stream","text":["['Jon Avery Abrahams', 'Zachary Burr Abel', 'Victor Aaron Ramirez', 'Quinton Aaron', 'Kirk M. Acevedo', 'Murray Abraham October', 'Alexander Bud Abbott', 'Christopher Jacob Abbott', 'Adam Keefe Horovitz', 'Jensen Ross Ackles', 'Yousef AbuTaleb', 'Jay Acovone', 'Walter Abel', 'Jacob Allen Abel', 'Bruce Paul Abbott']\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"9viumkzM-2fn","colab_type":"text"},"source":["### Query about the description of a person"]},{"cell_type":"code","metadata":{"id":"f2apBzko-sgv","colab_type":"code","colab":{}},"source":["def describe(graph, actor):\n","    nodes = graph.run(\"MATCH (:PERSON {name: '%s'})-[r]->(m)RETURN r,m\" % actor)\n","    flag=True\n","    for node in nodes:\n","        #print(node['m']['name'])\n","        print(node['r'])\n","        flag = False\n","    if flag:\n","        print(\"{} not found\".format(actor))"],"execution_count":0,"outputs":[]},{"cell_type":"code","metadata":{"id":"bNlvoFrm-shK","colab_type":"code","colab":{},"outputId":"132858e3-11b5-4f4f-c0a8-6d626190b1c9"},"source":["describe(graph, 'Jacob Allen Abel')\n","describe(graph, 'Adam Keefe Horovitz')"],"execution_count":0,"outputs":[{"output_type":"stream","text":["(Jacob Allen Abel)-[:is {}]->(singer)\n","(Jacob Allen Abel)-[:is {}]->(actor)\n","(Adam Keefe Horovitz)-[:is {}]->(actor)\n","(Adam Keefe Horovitz)-[:is {}]->(rapper guitarist)\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"21j0O1wm-shV","colab_type":"code","colab":{},"outputId":"88b853fc-1598-4377-907a-f78137a4d265"},"source":[""],"execution_count":0,"outputs":[{"output_type":"stream","text":["(Adam Keefe Horovitz)-[:is {}]->(actor)\n","(Adam Keefe Horovitz)-[:is {}]->(rapper guitarist)\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"EfLzKhaH-shg","colab_type":"code","colab":{},"outputId":"8cb93507-bb2b-4a8b-bc95-bc7ee4975814"},"source":["query_producers_names(graph)"],"execution_count":0,"outputs":[{"output_type":"stream","text":["['Yousef AbuTaleb']\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"9mgaF_RL-shq","colab_type":"code","colab":{}},"source":[""],"execution_count":0,"outputs":[]}]}