{
  "elements": {
    "nodes": [
      {
        "data": {
          "id": "I.1",
          "Devanagari_Text": "अथ योगानुशासनम् ॥ १.१ ",
          "Sanskrit_Text": "atha yogānuśāsanam",
          "Word_for_Word_Analysis": "atha—now. yoga—of Yoga, or concentration, contemplation (samādhi) anuśāsanaṃ—a revised text, or explanation.",
          "Translation_Bryant": "Now, the teachings of yoga [are presented].",
          "Translation_Leggett": "Now the exposition of yoga",
          "references": "Mahabhasya, I.1: atha śabdānuśāsanam https://archive.org/details/mahabhasya_of_patanjali_surendranath_dasgupta/page/n11/mode/2up?view=theater",
          "tags": "Grammarians",
          "Vyasa_sanskrit": "\n\nathetyayamadhikārārthaḥ. yogānuśāsanaṃ śāstramadhikṛtaṃ veditavyam. yogaḥ samādhiḥ. sa ca sārvabhaumaścittasya dharmaḥ. kṣiptaṃ mūḍhaṃ vikṣiptamekāgraṃ niruddhamiti cittabhūmayaḥ. tatra vikṣipte cetasi vikṣepopasarjanībhūtaḥ samādhirna yogapakṣe vartate. yastvekāgre cetasi sadbhūtamarthaṃ pradyotayati kṣiṇoti ca kleśān karmabandhanāni ślathayati nirodhamabhimukhaṃ karoti sa saṃprajñāto yoga ityākhyāyate. sa ca vitarkānugato vicārānugata ānandānugato'smitānugata ityupariṣṭānnivedayiṣyāmaḥ. sarvavṛttinirodhe tvasaṃprajñātaḥ samādhiḥ. ",
          "Vyasa_commentary": "“Now.”—This word here denotes undertaking. A text giving a revised critical teaching of Yoga is to be understood as having been undertaken.Yoga is contemplation (Samādhi, trance), and it is a characteristic of the mind pervading all its planes. The planes of the mind are:Wandering (Kṣipta); Forgetful (Mūḍha); Occasionally steady or distracted (Vikṣipta); One-pointed (Ekāgra); and Restrained (Niruddha),Of these the contemplation in the occasionally steady mind does not fall under the heading of Yoga, because of unsteadiness appearing in close sequence. That however, which in the one-pointed mind, fully shows forth an object existing as such in its most perfect form, removes the afflictions, loosens the bonds of karma and thus inclines it towards restraint, is said to be the Cognitive Trance (Saṃprajñāta Samādhi). And we shall explain further that this is accompanied by philosophical curiosity (vitarka), meditation (vicāra), bliss (ānanda), and egoism (asmitā).When however all the modifications come under restraint, the trance is ultra-cognitive (Asaṃprajñāta Samādhi).",
          "Vacaspati_commentary": "Bhagavān Patañjali here composed the aphorism, “Now a revised text of Yoga,” with the object of stating briefly the subject of the treatise he desired to write, so that it may attract the intelligent student and also that the reader may be able to understand with ease.The word ‘Now’ (atha) the first of the sentence is explained:—“‘Now”:—This word here denotes undertaking.”This word ‘now’ does not here denote sequence, as it does in, “‘Now’ there is light.”The word ‘anuśāsana’ means here a text-book, the derivative meaning being that by which something is taught; and this cannot be begun in sequence of the performance of mental and physical restraint. On the contrary however the desire to know and the knowledge of realities appear in sequence of the desire to explain the knowledge of realities. As says the Veda “Therefore let him see the self, in the self” after having controlled the mind and the senses and become desireless, enduring and contemplative, (Br. U. IV. 4. 23).Although it is possible that the questioning of a student the performance of purificatory actions (tapas), and employment of alchemy may serve as antecedents, they are not to be taken as such here, because the recognition and taking up of the study by a student are of no use in making a treatise on Yoga authoritative. Even if there should be no student for the time being, the work should be undertaken if authoritative. If however not authoritative, it should be given up, even though there be a student asking for it The existence of an immediate sequence between the knowledge of truth and the desire to explain it is hereby refuted.If, however, the meaning is to be taken to be undertaking, then by speaking of the Yoga to be discussed by undertaking the work, the whole meaning and object of the work is set forth; and the student is easily informed and set to work in the belief that trance is the means of the highest good, as set forth in the Vedas, the Smṛtis, the Itihāsas, and the Purāṇas.The question arises, Is the word ‘Now’ to be taken to mean undertaking in all works? Because in that case it would mean the same in the Vedānta Sūtra.Athāto Brahmajijñāsā.“Now then a desire to know Brahma.”—I.1.1.To meet this objection the Commentator specifies ‘This word here, &c.Another doubt arises. How is Patanjali, the author of the Yoga Teaching, when we have it in the Smṛti of the Yogī Yājñavalkya, that Hiraṇyagarbha and no other ancient was the original teacher of Yoga. For this reason the author of the aphorisms has used the word ‘Anuśāsana’ (revised text) which means teaching after it has already been taught, not only teaching.Because the word ‘Now’ means here an undertaking, the Commentator says that the meaning is that, ‘a text giving a revised critical teaching of Yoga is to be understood as having been undertaken.’But why should it be said that a work teaching Yoga is undertaken here? It is Yoga itself that is intended to be discussed here.For this reason is it said:—‘Is to be understood, &c.’ It is true that Yoga is spoken of as the subject of discussion here. It can, however, be discussed only by means of a work treating of the subject. The action of the teacher works through the instrument and does not directly operate upon the object. With the object of specifically mentioning the action of the teacher, his work treating of the subject of Yoga is to be understood as having been undertaken. Yoga, however, is to be undertaken as the subject of the work.It should also be known that the hearing of the sound of the word ‘atha’(now) when used to denote undertaking, is considered auspicious, like the sight of a jar full of water, which some one may be carrying.The Commentator now removes the doubt as to the meaning of the word ‘Yoga,’ which arises from its ordinary connotation. Thus says he, “Yoga is contemplation.” The word ‘Yoga’ is derived from the root √yuj, to contemplate, and not from the root Yujir, to join, in which latter case it would mean conjunction.Another question arises again. Trance (Samādhi) is to be described later on as being only a branch of Yoga. How can it then be that a part only may be the whole?The Commentator adds, for this reason:—‘and it pervades all its planes.’ It is the word ‘and’ (ca) which distinguishes the whole from the part.The planes are the states to be mentioned later on, the Madhumatī, the Madhupratīkā, and the Viśokā. They are the states of the mind in which the potencies only are left in residue in the mind. Yoga, defined as the restraint of mental modifications, is present in all these planes, i.e., in all these states of the mind. Not so the trance which is only a branch of it.Yoga is given here only its root meaning of contemplation, because the statement is made here only as an incentive to study, without intending to emphasize the distinction between the whole and the part. The real meaning of the word ‘Yoga’ is only the restraint of mental modifications.For the refutation of those who say that the restraint of mental modifications is dependent upon the self, by reason of the modifications themselves being cognitions and therefore dependent upon the self, it is said:—‘and it is a characteristic of the mind/By the word ‘mind’ (citta) the internal organ, the will-to-know is hinted at. The power of consciousness, which is constant in its eternity and thus unchangeable, cannot have the faculty of knowledge for its characteristic. The will-to-be, which is the same as the will-to-know, however may. This is the meaning.Grant that, but if the Yoga pervades all the mental planes, then, the wandering, the forgetful and the distracted planes of the mind too should be understood by the word ‘Yoga’ showing as they do the restraint of certain mental modifications relatively to the others. To remove this doubt, the planes to be taken and rejected as falling within ‘Yoga’ are mentioned, beginning with the word, ‘wandering, &c.The wandering plane or condition of the mind is that in which it is always thrown by disturbing Energy (Rajas) towards these and those objects, and is thus extremely unsteady.In the forgetful condition, the mind is possessed of the modification of deep sleep on account of the excess of inertia (the quality of Tamas).The occasionally steady or distracted is differentiated from the wandering. The difference consists in the occasional steadiness of that which is for the most part unsteady.This excess of its unsteadiness is either acquired, or brought about by the obstacles of disease, disinclination, &c., to be mentioned later.The one-pointed is that which moves along one line only.The restrained mind is that in which all the mental modifications have been restrained, and exist only as potencies.Of these, the wandering and the forgetful modifications are not denied here expressly the status of Yoga, being far removed as they are from that state, inasmuch as notwithstanding the existence of relative restraint in them, they do not even form links in the chain of causes which lead to the highest good, and because they are in conflict with the nature thereof. To the occasionally steady, however, the status of Yoga is expressly denied, because in this case it is possible to mistake it as such on account of its occasional manifestation of steadiness over existing objects of knowledge. In the occasionally steady mind the contemplation does not fall under the heading of Yoga consisting as it does only of an occasional steadiness of the mind over an existing object. Why? Because it is followed in close sequence by its contrary state of unsteadiness and in application. Having fallen as it does in the midst of the manifestations of a contrary class, its very nature becomes difficult to distinguish from -the very first as cause or effect, A seed which has remained in fire even for three or four seconds, will most certainly not sprout into leaves, even though sown.Which contemplative mental state is then Yoga, if not the one which follows or is followed closely by unsteadiness?‘That however which in the one-pointed mind, &c.’The words ‘existing as such’ keep out an object whose existence is only fastened upon the reality. The words, ‘in its roost perfect form’ are used to signify the best, i.e., that which manifests its essence to its utmost capacity. This is mentioned because the phenomenon of deep sleep also has a mind directed towards the one point which is its then object; that is to say, the quality of inertia (tamas) which though characterized by the absence of all other mental phenomena, does still exist as such; and the excess of inertia is bad because it is the cause of the afflictions.The word, ‘fully’ is used to qualify the words, ‘shows forth, because the showing forth, i.e., the knowledge of the realities may be accomplished by verbal and inferential cognitions also. Knowledge so obtained however, is not competent to remove nescience (avidyā) which is directly present in the mind; whereas inferential and verbal knowledge are after all indirect, the object being absent. The word ‘fully’ (pra) signifies intensity, and therefore indicates direct perceptual knowledge. The present sight of two moons and the doubt as to any particular direction of space go on existing, even though inference and authority point the other way.Egoism and the other afflictions have their root in nescience. The appearance of knowledge means the removal of nescience. Egoism and other afflictions are also removed on the appearance of knowledge, because they are contrary thereto, and because the cause of their existence is destroyed. For this reason the words, ‘removes the afflictions’ have been added to the description.For the same reason does it loosen the bonds in the shape of actions (karma). It is non-antecedent action that is desired to be understood here, by using the word denoting the cause to mean the effect.‘Loosens’ means renders unfit for the production of effects. It will be said further, “It ripens into life-time, life-state and life-experience, if the root exists.”—II.13.“And inclines it towards restraint” means that it was not so inclined before.This cognitive trance is four-fold. Hence is it said, ‘This is accompanied, &c.’The ultra-cognitive trance is described by the words,‘When however all the modifications, &c.’In the cognitive trance are restrained those mental modifications of real cognition, &c., which are of the nature of disturbing energy and inertia (rajas and tamas): and this is done by resort to the class of mental modifications which are of the nature of the essence (sattva). In the ultra-cognitive, however, all modifications are restrained. This is the meaning.The mental planes of Madhumatī, &c., which find their end in these two states, are all the planes. That which pervades all these planes is called Sārvabhauma, all-pervading.",
          "Hariharananda_Translation": "Now Then Yoga Is Being Explained.",
          "Vivekananda_translation": "Now concentration is explained"
        }
      },
      {
        "data": {
          "id": "I.2",
          "Devanagari_Text": "योगश् चित्तवृत्तिनिरोधः ॥ १.२ ",
          "Sanskrit_Text": "yogaś citta-vṛtti-nirodha",
          "Word_for_Word_Analysis": "yogaḥ—yoga. citta—of the mind, mental. vṛtti—of the modifications, changes, various forms. nirodhaḥ—restraint.",
          "Translation_Bryant": "Yoga is the stilling of the changing states of the mind.",
          "Translation_Leggett": "Yoga is inhibition of the mental processes",
          "tags": "Samkhya, Buddhism, Vṛtti",
          "Vyasa_sanskrit": "\n\nsarvaśabdāgrahaṇātsaṃprajñāto'pi yoga ityākhyāyate. cittaṃ hi prakhyāpravṛttisthitiśīlatvāttriguṇam. prakhyārūpaṃ hi cittasattvaṃ rajastamobhyāṃ saṃsṛṣṭamaiśvaryaviṣayapriyaṃ bhavati. tadeva tamasānuviddhamadharmājñānāvairāgyānaiśvaryopagaṃ bhavati. tadeva prakṣīṇamohāvaraṇaṃ sarvataḥ pradyotamānamanuviddhaṃ rajomātrayā dharmajñānavairāgyaiśvaryopagaṃ bhavati. tadeva rajoleśamalāpetaṃ svarūpapratiṣṭhaṃ sattvapuruṣānyatākhyātimātraṃ dharmameghadhyānopagaṃ bhavati. tatparaṃ prasaṃkhyānamityācakṣate dhyāyinaḥ. citiśaktirapariṇāminyapratisaṃkramā darśitaviṣayā śuddhā cānantā ca sattvaguṇātmikā ceyamato viparītā vivekakhyātiriti. atastasyāṃ viraktaṃ cittaṃ tāmapi khyātiṃ niruṇaddhi. tadavasthaṃ saṃskāropagaṃ bhavati. sa nirbījaḥ samādhiḥ. na tatra kiṃcitsaṃprajñāyata ityasaṃprajñātaḥ. dvividhaḥ sa yogaścittavṛttinirodha iti. ",
          "Vyasa_commentary": "The following aphorism was composed with the object of formulating its definition:—‘Yoga is the restraint of mental modifications.’Because the word, ‘all’ is not put in before (mental modifications) the Cognitive also is termed Yoga.The mind is possessed of the ‘three qualities,’ showing as it does the nature of illumination, activity and inertia. Mental Essence manifesting as illumination loves power and objects of sense, when mixed up with disturbing energy (rajas) and inertia (tamas). The same pierced through by inertia (tamas) approaches vice, ignorance, and absence of desirelessness and supineness. The same shining all round with the veil of forgetfulness removed, but affected by a touch of disturbing energy, approaches virtue, knowledge, desirelessness, and masterfulness. The same becomes itself when the least impurity of disturbing energy (rajas) is removed. It then shows forth only the distinction of nature between the Essence of objective being and the conscious principle (puruṣa), and approaches the state of trance called the Cloud of Virtue (dharma-megha). This the thinkers call the Highest intellection. (Param prasaṅkhyānam).The power of consciousness changes not. It goes not from object to object. The objects are shown to it. It is pure and infinite. This phenomenon (of the knowledge of the distinct nature of the two) is, however, of the nature of the Objective Essence, and is the opposite thereof. On this account the mind freed from attachment to that too, restrains even this form of manifestation. In that state it is possessed of residual potencies alone. That is the seedless trance. It is called the ultra-cognitive because nothing is cognized in that state.This is the two-fold Yoga, the restraint of mental modifications.",
          "Vacaspati_commentary": "The second aphorism is introduced by the words,‘This aphorism was composed, &c.’The word ‘its’ refers to the two descriptions of Yoga, mentioned in the previous aphorism.“Yoga is the restraint of mental modifications.”That particular state of the mind in which the manifestations of real cognition, &c., have been restrained, is the state of Yoga.The question arises, is not this definition bad, inasmuch as it does not cover the Cognitive Trance, in which that class of mental modifications which are of the very nature of its essence (sattva) are not restrained?For this reason the Commentator says:—“Because the word ‘all’ is not put in, &c.” If the restraint of all the mental modifications were mentioned, the definition would not cover the Cognitive Trance. The restraint of mental modifications, however, which checks the operation of the vehicles of affliction, action and fruition, comprehends that too. In the Cognitive Trance also, the mental modifications caused by disturbing Energy (rajas) and inertia (tamas) are restrained. In fact, the Cognitive trance is the restraint of these modifications.Why then does the one mind come into relationship with the wandering and other (more than one) planes? Further, what is the object of restraining the modifications of the mind so conditioned? To meet this apprehended questioning, the Commentator first takes up the cause of the mind thus coming into relationship with different conditions (planes).‘The mind is possessed of the three qualities:—The Essence (sattva) is there, because it has the nature of illumination. Disturbing Energy is there, because of its possessing the nature of activity. The quality of darkness (tamas) is there, because of its possessing the nature of inertia.The mention of the nature of illumination is suggestive. All the other qualities, therefore, of the Essence of things (sattva), such as brightness, lightness, joy and others are indicated.By activity other qualities of disturbing Energy, such as remorse and sorrow, etc., are indicated.Inertia is the characteristic modification of the quality of Tamas, the opposite of the quality of activity. By the mention of inactivity are indicated heaviness, interception, helplessness, etc.The meaning is that the mind although one, passes into more conditions than one, because it is made up of the three qualities (guṇas) and its modifications are various, because the ‘qualities’ being unequal, fall into a variety of combinations.Now the Commentator illustrates so far as may be, these very planes of the mind, the wandering and others, possessing as they do differences of sub-states:—“Mental Essence, &c.”Mental Essence means the Objective Essence (sattva) which has evolved as mind. By saying that the mental essence has the nature of illumination, it is shown that the mind has the quality of Essence (sattva) for its chief factor.When in the mind, the disturbing Energy and Inertia (rajas and tamas) are a little less predominant than its own Essence, but equal to each other, then to it are dear power and the objects of sense, such as sound, &c. The mind, on account of the Essence being its ruling factor, desires to dwell upon reality. But because the reality is veiled by Inertia (tamas) it mistakes the attainments of Attenuation (Aṇimā), &c., for the reality; and desires to dwell and dwells upon them for a moment. Being pushed away, however, by Energy (rajas), even from this resting place, it finds not the rest sought after even there, but gets only a liking for them. As to sound, &c., why its love of them is well established as a matter of course, ever inclining as it does towards them by its own nature. It is the occasionally steady mind that is thus described.While explaining the wandering mind, the author indicates the Forgetful mind also by words beginning with, ‘The same pierced through thereafter by Inertia, &c.’When Inertia flows into the mind and conquers Energy, then the Energy, having become incapable of driving the veil of the darkness of Inertia away from the Essence of the mind, it is rendered lazy by the Inertia, and approaches vice, &c. Ignorance is Untrue knowledge. Further, the knowledge in deep sleep is described as depending upon the notion of the absence of all other modifications. Therefore the state of forgetfulness (the Muḍhā Bhūmi) is also indicated. The absence of masterfulness or supineness is the non-fulfilment of one’s wishes everywhere. The meaning is that the mind becomes pervaded by vice, &c.By the words, ‘The same when the veil of forgetfulness, &c.,’ the author means that, when the same mental Essence shines out in its own nature, then the mind approaches virtue, knowledge, desirelessness and masterfulness. Forgetfulness is inertia (tamas) and the same is the veil. When the veil is removed, it becomes as above described. It is for this reason that it illuminates all the specialized, the unspecialized, the undifferentiated phenomenal and noumenal states and the Puruṣa.Inasmuch as notwithstanding this, it may not be capable of manifesting virtue and masterfulness on account of the absence of activity, the Commentator says ‘When it is affected by a touch of rajas, &c.’ The meaning is that because Energy is the cause of activity, virtue, &c., exist in that state.This gives a comprehensive description of the mental Essence of the two classes of Yogis who have reached the stage of Cognitive Trance, the Madhubhūmikas and the Prajñājyotiṣas of the middle path. Now the author describes the state of mind of the fourth class of Yogis, the Dhyānis or thinkers who have passed the domain of things to be known:—‘The same mind becomes itself, when the least impurity of disturbing Energy is removed.’ It is for this very reason that it becomes fixed in its own nature. Purified of the dross of disturbing Energy and Inertia (rajas and tamas) by the device of heating it with the re-agents of practice and desirelessness, the gold of the Essence of the will-to-know becomes established in its own' nature, and becomes the master of the senses and their objects, It has thus fulfilled much of its work, but goes on working; as its great work with the achievement of the knowledge of the distinction between the Objective Essence and consciousness. The author says:—“The same becomes itself when the least impurity of disturbing Energy is removed. It then shows forth only the distinction of nature between the Essence of Objective Nature and the conscious principle, and approaches the state of contemplation called the Cloud of Virtue.” The Cloud of Virtue will be described later. He describes here a term better known among the Yogis This the thinkers, &c.” The thinkers call the mind showing forth the distinction of the natures of the Objective Essence and the Conscious Principle, and having the Cloud of Virtue as the other end, by the name of the Highest Intellection. The mind is here spoken of as an abstraction, because the characteristic and the characterized are intended to be spoken of as one.The Commentator now shows that the power of consciousness is the good and the faculty of discriminative knowledge is not the good. This is with the object of introducing the īnhibitive Trance (Nirodha Samādhi), which restrains the mental modifications of discriminative knowledge, and brings about the perfect freedom of the conscious principle:—“The power of consciousness changes not, &c.”Impurity consists in identifying the self with pleasure and pain and forgetfulness. Pleasure and pain both cause pain to him who discriminates. Hence they too are to be given up like pain. Even the very beautiful gives pain having an end. Therefore that also has to be given up by him who discriminates. This impurity and end do not exist in the power of consciousness or the Puruṣa. Hence is it said to be pure and infinite.But how is this power of consciousness pure when it takes the forms of pleasureable, painful and forgetful objects, sounds, &c., while cognizing them? And how again is it infinite, when it takes up that form and also gives it up? To meet this the author says:—‘The objects are shown to it.’It is so described because the objective sounds, &c., are shown to it. It might be impure and finite if it took the forms of the objects in the same way as does the will-to-be. It is in fact the will-to-be that takes the forms of the objects, and presents them to the consciousness, which follows its forms. Thence is it said that the Puruṣa cognizes.The doubt again arises, how can an object be known if the power of consciousness do not take possession of the will-to-be appearing as an object? If it does take possession, how can it be said that it has not taken the form of the object? For this reason says the author:—“It goes not from object to object.”Going from object to object means motion, and the teaching is that consciousness does not move. But then how does it take possession of that form? For this reason he says:—“The power of consciousness changes not.”The three-fold change, indicated by characteristic, differentia and condition, does not exist in consciousness, that it may put on the form of action and thereby change in conjunction with the will-to-be. It will be described further on how it cognizes, even though it moves not.Thus it is established that the power of consciousness is the good. It has been said that the manifestation of discriminative knowledge is not the good, being as it is of the nature of the will-to-be. For this reason it is the opposite of the power of consciousness.When even the manifestation of discrimination also is to be given up, what is to be said of the other modifications which are full of shortcomings? This is the meaning. Hence for this reason, the discussion of the Inhibitive Trance is properly introduced. Therefore the author says:—“On this account the mind tends to turn from it, &c.” The meaning is that it checks the indulgence of discriminative knowledge too, by the Higher desirelessness, which the illumination of knowledge itself.Now he describes what the aspect of the mind is when all its modifications have been restrained:—“In that state, &c.” That state means the state of Restraint (Nirodha). The nature of restraint or inhibition is described “It is the seedless.”The vehicle of actions with that of afflictions is the seed of life-state, life-period and life-experience. The seedless is that which has gone beyond that.Now the author gives another name of the same which is better known to the Yogis and which is descriptive of the mental state, the ultra-cognitive.“Nothing is cognized in that, &c.”He summarizes:—“This is the two-fold Yoga, the restraint of the modifications of the mind.”",
          "Hariharananda_Translation": " Yoga Is The Suppression Of The Modifications Of The Mind\n[IT]:  Yoga is the inhibition of the modifications of the mind.",
          "Vivekananda_translation": " Yoga is restraining the mind – stuff (Chitta) from taking various forms (Vrittis)."
        }
	  },
	  {
        "data": {
          "id": "IV.34",
          "Devanagari_Text": "पुरुषार्थशून्यानां गुणानां प्रतिप्रसवः कैवल्यं स्वरूपप्रतिष्ठा वा चितिशक्तिर् इति ॥ ४.३४ ",
          "Sanskrit_Text": "puruṣārtha-śūnyānāṁ guṇānāṁ pratiprasavaḥ kaivalyaṁ svarūpa-pratiṣṭhā vā citi-śaktir iti",
          "Word_for_Word_Analysis": "puruṣārtha-śūnyānām—of those that are devoid of the object of the Puruṣa. guṇānām—of the qualities, pratiprasavaḥ—becoming latent, kaivalyam—absolute freedom. svarūpa-pratiṣṭhā—established in its own nature, vā—or. citi-śāktiḥ—the power of consciousness. iti—so, thus.",
          "Translation_Bryant": "Ultimate liberation is when the guṇas, devoid of any purpose for the puruṣa, return to their original [latent] state; in other words, when the power of consciousness is situated in its own essential nature.",
          "Vyasa_sanskrit": " kṛtabhogāpavargāṇāṃ puruṣārthaśūnyānāṃ yaḥ pratiprasavaḥ kāryakāraṇātmakānāṃ guṇānāṃ tatkaivalyaṃ, svarūpapratiṣṭhā punarbuddhisattvānabhisaṃbandhātpuruṣasya citiśaktireva kevalā, tasyāḥ sadā tathaivāvasthānaṃ kaivalyamiti. ",
          "Vyasa_commentary": "It has been said that absolute freedom comes when the succession of the functioning of the qualities in the performance of their duties is over. Its nature is now ascertained. Absolute freedom is the latency of the qualities on becoming devoid of the object of the Puruṣa, or it is the power of consciousness established in its own nature. Absolute freedom is the becoming latent by inverse process, of the qualities, when they are devoid of the object of the Puruṣa, after having achieved the experience and emancipation of the soul.The power of consciousness is absolute when it is not again limited.",
          "Vacaspati_commentary": "Describes the connection of the aphorism defining the nature of absolute freedom (kaivalya) with the previous aphorism:—‘It has been said, &c.’ Absolute freedom is the becoming latent of the qualities when they become devoid of the objects of the Puruṣa.’The becoming latent of the qualities in their cause, the Pradhāna, when they are devoid of the objects of the Puruṣa, having achieved them:—The out-going and the trance and the inhibitive potencies of the qualities which appear both as the causes and the effectṣ, become latent in the mind. The mind becomes latent in the principle of egoism. The principle of egoism becomes latent in the undifferentiated phenomenal, and the undifferentiative phenomenal into the noumenal.This backward disappearance of the qualities which appear as both the causes and the effects, is called absolute freedom of the Puruṣa, in relation to the Pradhāna from which he is released. Or, freedom is the establishment of the Puruṣa in his own nature. Says this, ‘Or, it is the power, &c.’ Inasmuch as in the Mahāpralaya, too, the power of consciousness is established in its own nature, but that is not Mokṣa, he says:—‘Does not come into relationship again, &c.’ The word ‘ITI’ in the aphorism means the end of the book.In this Chapter have been described the mind fit for freedom, and the trance known as the Cloud of Virtue, for establishing the Puruṣa, as he appears in the other world; also two descriptions of Mukti have been described and other things also by context.The root of the afflictions has been described, as also the afflictions; both the Yogas are described together with the eight accessories. The way of Mokṣa in the shape of the knowledge of the distinction between the Puruṣa and the qualities has been rendered plainer. Absolute freedom has been ascertained to be the power of consciousness free from the afflictions.Thus ends the Fourth Chapter of Absolute Freedom in the Gloss of Vācaspati Miśra on the Commentary of Vyāsa.—34.OM TAT SAT.For the service of Brahma.",
          "Hariharananda_Translation": "The State Of The Self In Itself Or Liberation Is Realised When The Gunas (Having Provided For The Experience And Liberation Of Purusa) Are Without Any Objective To Fulfill And Disappear Into Their Causal Substance.",
          "Vivekananda_translation": "[VN 4.33] The resolution in the inverse order of the qualities, berfect of any motive of action for the Purusa, is Kaivalya, or it is the establishment of the power of knowledge in its own nature."
        }
      }
    ],
    "edges": [
      {
        "data": {
          "source": "I.1",
          "target": "I.2",
          "id": "169f6755-5a6f-4c2e-ac5e-124649bcb8d7"
        }
      },
      {
        "data": {
          "source": "I.2",
          "target": "I.3",
          "id": "7f6171e1-3c8f-4fb5-828f-0c259ebc6edd"
        }
      },
      {
        "data": {
          "source": "I.37",
          "target": "I.39",
          "id": "8c0f4c79-8d5e-4ee3-873b-5bdb1b7023ac"
        }
      },
      {
        "data": {
          "source": "I.38",
          "target": "I.39",
          "id": "2a92724d-7d28-41cf-be9f-860b47235d72"
        }
      },
      {
        "data": {
          "source": "III.55",
          "target": "III.54",
          "id": "b22043e1-9b1b-47e6-ba7b-ba4a8195d840"
        }
      },
      {
        "data": {
          "source": "II.47",
          "target": "II.48",
          "id": "c43f8d4e-cd45-48b9-bc3e-899ba2d19e0d"
        }
      }
    ]
  },
  "positions": {
    "I.1": {
      "x": -1069.1906184015531,
      "y": -300.58282774606494
    },
    "IV.34": {
      "x": 4592.14649995524,
      "y": 5921.021468776722
    }
  }
}