{
  "text": {
    " ": 0,
    "h": 351,
    "e": 256,
    "y": 689,
    " h": 56,
    "he": 363,
    "ey": 307,
    "y ": 690,
    " he": 59,
    "hey": 369,
    "ey ": 308,
    " hey": 61,
    "hey ": 370,
    "o": 510,
    "w": 680,
    "d": 234,
    "ho": 377,
    "ow": 561,
    "wd": 681,
    "dy": 254,
    " ho": 64,
    "how": 380,
    "owd": 562,
    "wdy": 682,
    "dy ": 255,
    " how": 65,
    "howd": 381,
    "owdy": 563,
    "wdy ": 683,
    "t": 636,
    "r": 575,
    " t": 110,
    "th": 651,
    "er": 293,
    "re": 585,
    "e ": 257,
    " th": 113,
    "the": 655,
    "her": 367,
    "ere": 294,
    "re ": 586,
    " the": 115,
    "ther": 657,
    "here": 368,
    "ere ": 295,
    "l": 438,
    "el": 279,
    "ll": 449,
    "lo": 455,
    "o ": 511,
    "hel": 365,
    "ell": 280,
    "llo": 451,
    "lo ": 456,
    " hel": 60,
    "hell": 366,
    "ello": 282,
    "llo ": 452,
    "i": 384,
    "hi": 371,
    "i ": 385,
    " hi": 62,
    "hi ": 372,
    " hi ": 63,
    "g": 320,
    " g": 44,
    "go": 341,
    "oo": 537,
    "od": 517,
    "d ": 235,
    " go": 52,
    "goo": 342,
    "ood": 538,
    "od ": 518,
    " goo": 53,
    "good": 343,
    "ood ": 539,
    "m": 461,
    "n": 476,
    " m": 78,
    "mo": 471,
    "or": 546,
    "rn": 607,
    "ni": 497,
    "in": 399,
    "ng": 493,
    "g ": 321,
    " mo": 81,
    "mor": 474,
    "orn": 550,
    "rni": 608,
    "nin": 500,
    "ing": 406,
    "ng ": 494,
    " mor": 82,
    "morn": 475,
    "orni": 551,
    "rnin": 609,
    "ning": 501,
    "ing ": 407,
    "v": 675,
    " e": 38,
    "ev": 304,
    "ve": 676,
    "en": 283,
    " ev": 39,
    "eve": 305,
    "ven": 678,
    "eni": 286,
    " eve": 40,
    "even": 306,
    "veni": 679,
    "enin": 287,
    "a": 136,
    " d": 35,
    "de": 239,
    "ea": 258,
    "ar": 176,
    "r ": 576,
    " de": 36,
    "dea": 240,
    "ear": 263,
    "ar ": 177,
    " dea": 37,
    "dear": 241,
    "ear ": 264,
    "s": 618,
    " s": 99,
    "si": 626,
    "ir": 412,
    " si": 104,
    "sir": 627,
    "ir ": 413,
    " sir": 105,
    "sir ": 628,
    " y": 123,
    "ye": 691,
    "es": 302,
    "s ": 619,
    " ye": 124,
    "yes": 697,
    "es ": 303,
    " yes": 127,
    "yes ": 698,
    "p": 564,
    "ep": 291,
    "p ": 565,
    "yep": 695,
    "ep ": 292,
    " yep": 126,
    "yep ": 696,
    "ah": 144,
    "h ": 352,
    "yea": 693,
    "eah": 259,
    "ah ": 145,
    " yea": 125,
    "yeah": 694,
    "eah ": 260,
    " i": 66,
    "nd": 485,
    "ee": 272,
    "ed": 270,
    " in": 68,
    "ind": 403,
    "nde": 487,
    "dee": 242,
    "eed": 274,
    "ed ": 271,
    " ind": 69,
    "inde": 404,
    "ndee": 488,
    "deed": 243,
    "eed ": 275,
    "ha": 353,
    "at": 178,
    "t ": 637,
    "tha": 652,
    "hat": 359,
    "at ": 179,
    " tha": 114,
    "that": 654,
    "hat ": 360,
    "b": 191,
    " b": 16,
    "be": 197,
    " be": 19,
    "be ": 198,
    " be ": 20,
    " r": 93,
    "ri": 596,
    "ig": 394,
    "gh": 333,
    "ht": 382,
    " ri": 97,
    "rig": 602,
    "igh": 395,
    "ght": 336,
    "ht ": 383,
    " rig": 98,
    "righ": 603,
    "ight": 396,
    "ght ": 337,
    "k": 427,
    " o": 83,
    "ok": 529,
    "k ": 428,
    " ok": 86,
    "ok ": 530,
    " ok ": 87,
    "gr": 344,
    " gr": 54,
    "gre": 347,
    "rea": 587,
    "eat": 265,
    " gre": 55,
    "grea": 348,
    "reat": 589,
    "eat ": 266,
    ",": 132,
    " ,": 1,
    ", ": 133,
    " , ": 2,
    "an": 161,
    "nk": 506,
    "han": 354,
    "ank": 166,
    "nk ": 507,
    "than": 653,
    "hank": 356,
    "ank ": 167,
    "u": 665,
    "yo": 699,
    "ou": 557,
    "u ": 666,
    " yo": 128,
    "you": 700,
    "ou ": 558,
    " you": 129,
    "you ": 701,
    "c": 205,
    " c": 25,
    "co": 225,
    "rr": 615,
    "ec": 267,
    "ct": 230,
    " co": 30,
    "cor": 228,
    "orr": 552,
    "rre": 616,
    "rec": 590,
    "ect": 268,
    "ct ": 231,
    " cor": 32,
    "corr": 229,
    "orre": 553,
    "rrec": 617,
    "rect": 591,
    "ect ": 269,
    "ch": 215,
    "oi": 526,
    "ic": 388,
    "ce": 213,
    " ch": 26,
    "cho": 220,
    "hoi": 378,
    "oic": 527,
    "ice": 392,
    "ce ": 214,
    " cho": 29,
    "choi": 221,
    "hoic": 379,
    "oice": 528,
    "ice ": 393,
    "so": 629,
    "un": 670,
    " so": 106,
    "sou": 630,
    "oun": 559,
    "und": 671,
    "nd ": 486,
    " sou": 107,
    "soun": 631,
    "ound": 560,
    "und ": 672,
    "al": 149,
    "ly": 459,
    " re": 94,
    "eal": 261,
    "all": 154,
    "lly": 453,
    "ly ": 460,
    " rea": 95,
    "real": 588,
    "eall": 262,
    "ally": 155,
    "lly ": 454,
    "by": 202,
    " by": 23,
    "bye": 203,
    "ye ": 692,
    " bye": 24,
    "bye ": 204,
    "db": 236,
    "odb": 519,
    "dby": 237,
    "oodb": 540,
    "odby": 520,
    "dbye": 238,
    "se": 623,
    " se": 102,
    "see": 624,
    "ee ": 273,
    " see": 103,
    "see ": 625,
    "cu": 232,
    " cu": 33,
    "cu ": 233,
    " cu ": 34,
    "ao": 170,
    "cha": 216,
    "hao": 357,
    "ao ": 171,
    " cha": 27,
    "chao": 217,
    "hao ": 358,
    "av": 185,
    " ha": 57,
    "hav": 361,
    "ave": 186,
    "ve ": 677,
    " hav": 58,
    "have": 362,
    "ave ": 187,
    " a": 5,
    "a ": 137,
    " a ": 6,
    "on": 533,
    "ne": 491,
    " on": 88,
    "one": 535,
    "ne ": 492,
    " one": 89,
    "one ": 536,
    " w": 119,
    "wh": 684,
    " wh": 120,
    "wha": 685,
    " wha": 121,
    "what": 686,
    "ba": 192,
    "ac": 138,
    "ck": 222,
    "kg": 429,
    "ro": 610,
    " ba": 17,
    "bac": 193,
    "ack": 139,
    "ckg": 223,
    "kgr": 430,
    "gro": 349,
    "rou": 613,
    " bac": 18,
    "back": 194,
    "ackg": 140,
    "ckgr": 224,
    "kgro": 431,
    "grou": 350,
    "roun": 614,
    "f": 309,
    " f": 41,
    "fo": 317,
    " fo": 42,
    "for": 318,
    "or ": 547,
    " for": 43,
    "for ": 319,
    "af": 141,
    "fg": 314,
    "is": 416,
    "st": 632,
    "ta": 638,
    "n ": 477,
    " af": 7,
    "afg": 142,
    "fgh": 315,
    "gha": 334,
    "ani": 163,
    "nis": 502,
    "ist": 417,
    "sta": 633,
    "tan": 639,
    "an ": 162,
    " afg": 8,
    "afgh": 143,
    "fgha": 316,
    "ghan": 335,
    "hani": 355,
    "anis": 165,
    "nist": 503,
    "ista": 418,
    "stan": 634,
    "tan ": 640,
    "?": 134,
    " ?": 3,
    "? ": 135,
    " ? ": 4,
    "he ": 364,
    "the ": 656,
    " l": 75,
    "oc": 514,
    "ca": 207,
    "ti": 658,
    "io": 409,
    " lo": 76,
    "loc": 457,
    "oca": 515,
    "cat": 210,
    "ati": 183,
    "tio": 659,
    "ion": 410,
    "on ": 534,
    " loc": 77,
    "loca": 458,
    "ocat": 516,
    "cati": 212,
    "atio": 184,
    "tion": 660,
    "ion ": 411,
    "ge": 327,
    "eo": 288,
    "og": 523,
    "ra": 577,
    "ap": 172,
    "ph": 566,
    "c ": 206,
    " ge": 47,
    "geo": 328,
    "eog": 289,
    "ogr": 524,
    "gra": 345,
    "rap": 578,
    "aph": 174,
    "phi": 567,
    "hic": 373,
    "ic ": 389,
    " geo": 48,
    "geog": 329,
    "eogr": 290,
    "ogra": 525,
    "grap": 346,
    "raph": 579,
    "aphi": 175,
    "phic": 568,
    "hic ": 374,
    "rd": 582,
    "di": 244,
    "na": 478,
    "te": 643,
    "coo": 226,
    "oor": 541,
    "ord": 548,
    "rdi": 583,
    "din": 247,
    "ina": 400,
    "nat": 480,
    "ate": 180,
    "te ": 644,
    " coo": 31,
    "coor": 227,
    "oord": 542,
    "ordi": 549,
    "rdin": 584,
    "dina": 248,
    "inat": 402,
    "nate": 481,
    "ate ": 181,
    "ma": 463,
    " ma": 79,
    "map": 466,
    "ap ": 173,
    " map": 80,
    "map ": 467,
    "ef": 276,
    "fe": 311,
    "nc": 482,
    "ref": 592,
    "efe": 277,
    "fer": 312,
    "ren": 594,
    "enc": 284,
    "nce": 483,
    " ref": 96,
    "refe": 593,
    "efer": 278,
    "fere": 313,
    "eren": 296,
    "renc": 595,
    "ence": 285,
    "nce ": 484,
    "ak": 146,
    "kr": 435,
    "ot": 554,
    " ak": 9,
    "akr": 147,
    "kro": 436,
    "rot": 611,
    "oti": 555,
    "tir": 661,
    "iri": 414,
    "ri ": 597,
    " akr": 10,
    "akro": 148,
    "krot": 437,
    "roti": 612,
    "otir": 556,
    "tiri": 662,
    "iri ": 415,
    "lb": 443,
    "ia": 386,
    " al": 11,
    "alb": 150,
    "lba": 444,
    "ban": 195,
    "nia": 498,
    "ia ": 387,
    " alb": 12,
    "alba": 151,
    "lban": 445,
    "bani": 196,
    "ania": 164,
    "nia ": 499,
    "lg": 446,
    "alg": 152,
    "lge": 447,
    "ger": 330,
    "eri": 297,
    "ria": 598,
    " alg": 13,
    "alge": 153,
    "lger": 448,
    "geri": 331,
    "eria": 298,
    "ria ": 599,
    "am": 156,
    "me": 468,
    " am": 14,
    "ame": 157,
    "mer": 469,
    "ric": 600,
    "ica": 390,
    "can": 208,
    " ame": 15,
    "amer": 158,
    "meri": 470,
    "eric": 299,
    "rica": 601,
    "ican": 391,
    "can ": 209,
    "sa": 620,
    "oa": 512,
    " sa": 100,
    "sam": 621,
    "amo": 159,
    "moa": 472,
    "oa ": 513,
    " sam": 101,
    "samo": 622,
    "amoa": 160,
    "moa ": 473,
    " p": 90,
    "po": 569,
    "op": 543,
    "pu": 572,
    "ul": 667,
    "la": 440,
    " po": 91,
    "pop": 570,
    "opu": 544,
    "pul": 573,
    "ula": 668,
    "lat": 441,
    " pop": 92,
    "popu": 571,
    "opul": 545,
    "pula": 574,
    "ulat": 669,
    "lati": 442,
    "of": 521,
    "f ": 310,
    " of": 84,
    "of ": 522,
    " of ": 85,
    "ndi": 489,
    "dia": 245,
    "indi": 405,
    "ndia": 490,
    "dia ": 246,
    "gd": 322,
    "dp": 252,
    " gd": 45,
    "gdp": 325,
    "dp ": 253,
    " gdp": 46,
    "gdp ": 326,
    "gi": 338,
    "iv": 424,
    " gi": 50,
    "giv": 339,
    "ive": 425,
    " giv": 51,
    "give": 340,
    "ive ": 426,
    " i ": 67,
    "chi": 218,
    "hin": 375,
    "na ": 479,
    " chi": 28,
    "chin": 219,
    "hina": 376,
    "ina ": 401,
    "l ": 439,
    " te": 111,
    "tel": 647,
    "ll ": 450,
    " tel": 112,
    "tell": 648,
    "ell ": 281,
    "whe": 687,
    " whe": 122,
    "wher": 688,
    "cate": 211,
    "’": 706,
    " ’": 130,
    "’ ": 707,
    " ’ ": 131,
    "it": 419,
    "ts": 663,
    " it": 70,
    "its": 422,
    "ts ": 664,
    " its": 71,
    "its ": 423,
    "z": 702,
    "br": 199,
    "az": 188,
    "zi": 703,
    "il": 397,
    " br": 21,
    "bra": 200,
    "raz": 580,
    "azi": 189,
    "zil": 704,
    "il ": 398,
    " bra": 22,
    "braz": 201,
    "razi": 581,
    "azil": 190,
    "zil ": 705,
    " u": 116,
    " un": 117,
    "uni": 673,
    "nit": 504,
    "ite": 420,
    "ted": 645,
    " uni": 118,
    "unit": 674,
    "nite": 505,
    "ited": 421,
    "ted ": 646,
    " st": 108,
    "tat": 641,
    "tes": 649,
    " sta": 109,
    "stat": 635,
    "tate": 642,
    "ates": 182,
    "tes ": 650,
    " k": 72,
    "ki": 432,
    "do": 249,
    "om": 531,
    "m ": 462,
    " ki": 73,
    "kin": 433,
    "ngd": 495,
    "gdo": 323,
    "dom": 250,
    "om ": 532,
    " kin": 74,
    "king": 434,
    "ingd": 408,
    "ngdo": 496,
    "gdom": 324,
    "dom ": 251,
    "rm": 604,
    "ny": 508,
    "erm": 300,
    "rma": 605,
    "man": 464,
    "any": 168,
    "ny ": 509,
    " ger": 49,
    "germ": 332,
    "erma": 301,
    "rman": 606,
    "many": 465,
    "any ": 169
  },
  "response": null,
  "action_text": null
}